<?xml version="1.0" encoding="windows-1252"?>
<node id="272365" title="Os usuários do PerlMonks são analisados?" created="2003-07-08 14:04:04" updated="2005-08-12 13:08:07">
<type id="17338">
sitefaqlet</type>
<author id="17342">
SiteDocClan</author>
<data>
<field name="doctext">
&lt;!-- 2004-06-18 - Monsieur Champs - Translation to pt_br --&gt;
&lt;!-- 2004-01-26 - jdporter - updated, regularized. --&gt;
&lt;!-- 2003-05-23 - Mr. Muskrat - added link back to the PerlMonks FAQ --&gt;
&lt;!-- 2003-06-11 - Monsieur Champs - Translation to pt_br --&gt;
&lt;p align="right"&gt;&lt;b&gt;&lt;i&gt;This was translated from the "[id://174035]" node.&lt;/i&gt;&lt;/b&gt;&lt;/p&gt;
&lt;p&gt;
  Os [gods|deuses] do website t&amp;ecirc;m acesso completo ao banco
  de dados, ao c&amp;oacute;digo fonte do website, e aos &lt;i&gt;logs&lt;/i&gt;
  do servidor do website do PerlMonks. Desta forma, em
  princ&amp;iacute;pio, existe muito pouca coisa que eles n&amp;atilde;o
  poderiam fazer. Outros grupos de usu&amp;aacute;rios especiais,
  como os [editors|editores] e [power users] t&amp;ecirc;m poderes
  que podem afetar outros usu&amp;aacute;rios, mas estes poderes
  s&amp;atilde;o limitados pelos mecanismos atrav&amp;eacute;s dos quais
  os poderes s&amp;atilde;o utilizados. Tais limita&amp;ccedil;&amp;otilde;es
  n&amp;atilde;o s&amp;atilde;o impostas aos [gods|deuses], que
  freq&amp;uuml;&amp;ecirc;ntemente precisam lidar com o banco de dados
  diretamente no decorrer do desenvolvimento. Isto &amp;eacute; bem normal
  para websites de discuss&amp;atilde;o e comunidades baseadas da web.
&lt;/p&gt;
&lt;p&gt;
  Os [gods|deuses] usam ferramentas baseadas
  na web para tratar da manuten&amp;ccedil;&amp;atilde;o do website,
  e poucas destas ferramentas seriam &amp;uacute;teis em monitorar
  usu&amp;aacute;rios. Em alguns casos, provid&amp;ecirc;ncias foram 
  tomadas para protejer informa&amp;ccedil;&amp;otilde;es sens&amp;iacute;veis
  de um usu&amp;aacute;rio de uma inspe&amp;ccedil;&amp;atilde;o casual.
  A ferramenta que permite a um [gods|deus] olhar as
  vari&amp;aacute;veis de um usu&amp;aacute;rio (n&amp;atilde;o em
  circunst&amp;acirc;ncias comuns, mas tamb&amp;eacute;m n&amp;atilde;o
  t&amp;atilde;o extraordin&amp;aacute;rias assim), por exemplo,
  foi alterada de modo a n&amp;atilde;o exibir a senha do usu&amp;aacute;rio 
  juntamente com o restante das vari&amp;aacute;veis.
&lt;/p&gt;
&lt;p&gt;
  Em resumo, n&amp;atilde;o existem salvaguardas s&amp;oacute;lidas para
  suas informa&amp;ccedil;&amp;otilde;es pessoais ou seus h&amp;aacute;bitos.
  Voc&amp;ecirc; deveria entender isso, e tomar suas deci&amp;otilde;es 
  de acordo.
&lt;/p&gt;
&lt;p&gt;
  Isto basta para o que os [gods|deuses] podem fazer. O que eles realmente fazem &amp;eacute; um pouco diferente. 
&lt;/p&gt;
&lt;p&gt;
  Coisas que tendem a atrair o interesse dos [gods|deuses]
  s&amp;atilde;o comportamento abusivo e rob&amp;ocirc;s votadores
  (&lt;i&gt;votebots&lt;/i&gt;). Tanto os [gods|deuses] quanto os 
  [power users] t&amp;ecirc;m o poder de temporariamente
  silenciar pessoas no &lt;i&gt;Chatterbox&lt;/i&gt;, e fazem isso de
  tempos em tempos.
&lt;/p&gt;
&lt;p&gt;
  Um sistema razoavelmente extenso est&amp;aacute; a postos
  para permitir aos usu&amp;aacute;rios do website filtrar
  conte&amp;uacute;do inapropriado em artigos, e enquanto
  isso acontece de tempos em tempos, raramente &amp;eacute;
  necess&amp;aacute;rio aos [gods|deuses] intervir diretamente.
&lt;/p&gt;
&lt;p&gt;
  Os [Editors|Editores] tamb&amp;eacute;m t&amp;ecirc;m algum poder
  aqui, e s&amp;atilde;o capazes de alterar artigos ou votar 
  para uma remo&amp;ccedil;&amp;atilde;o por "via r&amp;aacute;pida".
  A primeira acontece em uma base regular, se bem
  que muito mais para corrigir erros do que coibir
  comportamento abusivo. A &amp;uacute;ltima &amp;eacute; costumaz
  como suplemento do processo de considera&amp;ccedil;&amp;atilde;o.
&lt;/p&gt;
&lt;p&gt;
  Em termos de acompanhar usu&amp;aacute;rios, os [gods|deuses] 
  executam algumas an&amp;aacute;lises de registros. Estas s&amp;atilde;o
  projetadas para tratar os usu&amp;aacute;rios de maneira an&amp;ocirc;nimas.
  As ferramentas permitem aos [gods|deuses], isolar usu&amp;aacute;rios
  com padr&amp;otilde;es de uso altamente incomuns,
  sem ter de olhar outras informa&amp;ccedil;&amp;otilde;es do usu&amp;aacute;rio.
&lt;/p&gt;
&lt;p&gt;
  [gods|deuses] t&amp;ecirc;m uma &amp;eacute;tica que reflete a
  tradi&amp;ccedil;&amp;atilde;o do site de auto-conten&amp;ccedil;&amp;atilde;o
  volunt&amp;aacute;ria e respeito aos outros. Os [gods|deuses]
  n&amp;atilde;o tem interesse em seus registros de votos.
  Para finalizar, esta quest&amp;atilde;o se resume a confian&amp;ccedil;a.
  Voc&amp;ecirc; precisa julgar por voc&amp;ecirc; mesmo, e decidir
  o qu&amp;atilde;o aberta voc&amp;ecirc; pensa ser esta comunidade,
  e se voc&amp;ecirc; deseja gastar seu tempo aqui.
&lt;/p&gt;
</field>
</data>
</node>
