<?xml version="1.0" encoding="windows-1252"?>
<node id="368644" title="J'ai besoin d'aide! Qui peut m'aider?" created="2004-06-22 04:38:21" updated="2005-08-12 10:34:48">
<type id="17338">
sitefaqlet</type>
<author id="17342">
SiteDocClan</author>
<data>
<field name="doctext">
&lt;!-- 2004-06-22 - dfaure - created placeholder [id] --&gt;
&lt;!-- 2004-06-22 - dfaure - 0.1 - new document --&gt;
&lt;!-- 2004-06-28 - dfaure - 1.0 - corrections applied and changed status to 'Stable' --&gt;

&lt;h1&gt;J'ai besoin d'aide! Qui peut m'aider?&lt;/h1&gt;

&lt;p align="right"&gt;&lt;i&gt;Une traduction de/A translation of [id://243873]&lt;/i&gt;&lt;/p&gt;

&lt;p&gt;Si vous &amp;ecirc;tes &amp;agrave; la recherche d'&amp;eacute;claircissements concernant l'usage de Perl, alors vous &amp;ecirc;tes au bon endroit.&lt;/p&gt;

&lt;p&gt;D'abord, vous voudrez cr&amp;eacute;er un compte utilisateur sur PerlMonks. Reportez &amp;agrave; la section [id://156908] (Cr&amp;eacute;er un compte sur PerlMonks) pour plus de d&amp;eacute;tails sur le comment et le pourquoi vous voudrez le faire mais la r&amp;eacute;ponse br&amp;egrave;ve est que vous pourrez facilement trouver votre question et voir les r&amp;eacute;ponses m&amp;ecirc;me si celle-ci n'a pas &amp;eacute;t&amp;eacute; [id://17688|approuv&amp;eacute;e].&lt;/p&gt;

&lt;p&gt;Mais plus pr&amp;eacute;cis&amp;eacute;ment, la cr&amp;eacute;ation d'un utilisateur vous permet une plus grande participation ainsi que l'obtention du plus grand b&amp;eacute;n&amp;eacute;fice du monast&amp;egrave;re.&lt;/p&gt;

&lt;p&gt;Maintenant vous devez d&amp;eacute;cider o&amp;ugrave; publier votre appel &amp;agrave; l'aide.&lt;/p&gt;

&lt;p&gt;Si vous avez une question, quelque soit sa longueur, ou qui requiert l'inclusion de code source, vous voudrez plus probablement la publier dans la rubrique [id://479] (Chercheurs de Sagesse Perl), mais avant de le faire, assurez-vous d'avoir consult&amp;eacute; les recommendations du point '[id://483077|Publier sur PM]' dans la '[PerlMonks FAQ|FAQ PerlMonks]' pour une mise en forme de votre publication du plus bel effet.&lt;/p&gt;

&lt;p&gt;Si votre question concerne un petit morceau de code et peut avoir une r&amp;eacute;ponse en deux ou trois lignes, vous pouvez le soumettre dans la Bo&amp;icirc;te &amp;agrave; discussion et les Moines passant par l&amp;agrave; &amp;agrave; cet instant pourront offrir leurs conseils et assistance tant que faire ce peut. Avant de le faire, assurez-vous d'avoir consult&amp;eacute; la '[id://236794|FAQ sur la Bo&amp;icirc;te &amp;agrave; discussion]' pour de plus amples informations et l'&amp;eacute;tiquette et les clients alternatifs pouvant rendre votre exp&amp;eacute;rience plus enrichissante.&lt;/p&gt;

&lt;hr/&gt;&lt;i&gt;Retour &amp;agrave;/Back to [PerlMonks FAQ]&lt;/i&gt;</field>
</data>
</node>
