<node>
  <doctext>&lt;!-- 2003-10-14 - Monsieur Champs - Translated to pt_BR --&gt;
&lt;!-- 2003-08-14 - Mr. Muskrat - updated Note Configuration as suggested by [woolfy] in [id://283495] --&gt;
&lt;!-- 2003-07-05 - pfaut - added text for new option to turn off links at top of page - see [id://271573] --&gt;
&lt;!-- 2003-02-26 - pfaut - matched index names to section names --&gt;
&lt;!-- 2003-02-25 - pfaut - added missing fields, corrected for some label; changes, reworded some sections --&gt;

&lt;h1&gt;Como eu altero minhas prefer&amp;ecirc;ncias?&lt;/h1&gt;

&lt;!--
&lt;p align=&quot;right&quot;&gt;&lt;font size=&quot;-1&quot;&gt;&lt;i&gt;This is a translation of the &quot;[id://17642]&quot; node.&lt;/i&gt;&lt;/font&gt;&lt;/p&gt;
--&gt;

&lt;p&gt;Suas prefer&amp;ecirc;ncias de usu&amp;aacute;rio se encontram
em sua p&amp;aacute;gina de [User Settings|prefer&amp;ecirc;ncias de usu&amp;aacute;rio];
ou em seu home node &lt;sup&gt;[id://298524|&amp;#8594;]&lt;/sup&gt;, no link 
&quot;Change your user settings&quot; :&amp;#91;NT: do ingl&amp;ecirc;s: &quot;Altere suas prefer&amp;ecirc;ncias de usu&amp;Aacute;rio&quot;&amp;#93;; ou digite [User Settings] na caixa de busca no topo de qualquer p&amp;aacute;gina.&lt;/p&gt;

&lt;h2&gt;Personalizando suas prefer&amp;ecirc;ncias&lt;/h2&gt;

&lt;p&gt;Modifique a p&amp;aacute;gina [User Settings] para alterar
a forma que o site funciona para voc&amp;ecirc;. Certifique-se
de pressionar o bot&amp;atilde;o &lt;i&gt;submit&lt;/i&gt; no final da p&amp;aacute;gina
para que as altera&amp;ccedil;&amp;otilde;es tenham efeito.&lt;/p&gt;

&lt;ul&gt;

&lt;li&gt;&lt;a href=&quot;#time&quot;&gt;Escolhendo um fuso hor&amp;aacute;rio&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#frontpage&quot;&gt;Configura&amp;ccedil;&amp;atilde;o da primeira p&amp;aacute;gina&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#note&quot;&gt;Configura&amp;ccedil;&amp;atilde;o de Notas&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#theme&quot;&gt;Configura&amp;ccedil;&amp;atilde;o de Temas&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#nonfront&quot;&gt;N&amp;oacute;s que n&amp;atilde;o pertencem &amp;agrave; primeira p&amp;aacute;gina&lt;/a&gt;&lt;/li&gt;

&lt;li&gt;&lt;a href=&quot;#misc&quot;&gt;Op&amp;ccedil;&amp;otilde;es Diversas&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#private&quot;&gt;Op&amp;ccedil;&amp;otilde;es para mensagens privadas&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#sig&quot;&gt;Sua assinatura&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#titles&quot;&gt;Defini&amp;ccedil;&amp;atilde;o de t&amp;iacute;tutlo de n&amp;oacute; personalizado&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#styles&quot;&gt;Op&amp;ccedil;&amp;otilde;es de Folha de Estilo&lt;/li&gt;

&lt;li&gt;&lt;a href=&quot;#personal&quot;&gt;Construindo o seu N&amp;oacute; Pessoal&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&quot;#newest&quot;&gt;Limpe meu &lt;i&gt;flag&lt;/i&gt; de n&amp;oacute;s mais recentes&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;h3&gt;&lt;a name=&quot;time&quot;&gt;&lt;/a&gt;Escolhendo um Fuso Hor&amp;aacute;rio&lt;/h3&gt;

&lt;p&gt;Selecionar o fuso hor&amp;aacute;rio correto &amp;eacute; importante 
porque isso filtra todas as datas em artigos, hor&amp;aacute;rios de login,
etc. de acordo com o seu fuso hor&amp;aacute;rio particular. Note que 
as horas t&amp;ecirc;m formato de 24 horas, n&amp;atilde;o de 12 horas.
O hor&amp;aacute;rio de ver&amp;atilde;o n&amp;atilde;o &amp;eacute; calculado
automaticamente para voc&amp;ecirc;.&lt;/p&gt;

&lt;p&gt;Voc&amp;ecirc; pode selecionar um fuso hor&amp;aacute;rio 
da lista &lt;i&gt;dropdown&lt;/i&gt; ou visitando
[Timezone Settings|Op&amp;ccedil;&amp;otilde;es de Fuso Hor&amp;aacute;rio].
A lista de fusos hor&amp;aacute;rios em
[Timezone Settings|Op&amp;ccedil;&amp;otilde;es de Fuso Hor&amp;aacute;rio]
&amp;eacute; mais completa.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;frontpage&quot;&gt;&lt;/a&gt;Configura&amp;ccedil;&amp;atilde;o da Primeira P&amp;aacute;gina&lt;/h3&gt;

&lt;p&gt;A primeira p&amp;aacute;gina &amp;eacute;
[The Monastery Gates|O Portal do Monsteiro]. Voc&amp;ecirc;
pode escolher quais sec&amp;ccedil;&amp;otilde;es do mosteiro
ser&amp;atilde;o exibidas para voc&amp;ecirc; l&amp;aacute;.
Simplesmente marque as sec&amp;ccedil;&amp;otilde;es que
voc&amp;ecirc; n&amp;atilde;o deseja ver. A coluna de N&amp;uacute;mero
M&amp;aacute;ximo de Entradas permite a voc&amp;ecirc; ajustar
o n&amp;uacute;meros de notas exibidos em cada sec&amp;ccedil;&amp;atilde;o
Se voc&amp;ecirc; deixar estes campos em branco, ser&amp;aacute;

assumido um valor &lt;i&gt;default&lt;/i&gt; razo&amp;aacute;vel.&lt;/p&gt;

&lt;p&gt;Voc&amp;ecirc; pode escolher quais &lt;i&gt;nodelets&lt;/i&gt; ser&amp;atilde;o
exibidos na primeira p&amp;aacute;gina. &lt;i&gt;Nodelets&lt;/i&gt; s&amp;atilde;o caixas
de texto especializadas, que cont&amp;eacute;m informa&amp;ccedil;&amp;otilde;es
importantes e links, e que aparecem em todas as p&amp;aacute;ginas.
Para que voc&amp;eacute; use o mesmo conjunto de &lt;i&gt;Nodelets&lt;/i&gt; em todas
as p&amp;aacute;ginas, marque a op&amp;ccedil;&amp;atilde;o &quot;Use my frontpage
nodelets everywhere&quot; &amp;#91;NT: do ingl&amp;ecirc;s &quot;Use meus

&lt;i&gt;nodelets&lt;/i&gt; da primeira p&amp;aacute;gina em todo lugar&quot;&amp;#93;.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;note&quot;&gt;&lt;/a&gt;Configura&amp;ccedil;&amp;atilde;o de Notas&lt;/h3&gt;

&lt;p&gt;Estas configura&amp;ccedil;&amp;otilde;es controlam a
exibi&amp;ccedil;&amp;atilde;o de um &amp;uacute;nico artigo
de uma discuss&amp;atilde;o. A configura&amp;ccedil;&amp;atilde;o

&lt;em&gt;Replies header depth&lt;/em&gt; &amp;#91;NT: do ingl&amp;ecirc;s:
&quot;&lt;i&gt;Profundidade do Cabe&amp;ccedil;alho de Respostas&lt;/i&gt;&quot;&amp;#93;
controla quantos n&amp;iacute;veis de cabe&amp;ccedil;alhos
s&amp;atilde;o exibidos em uma p&amp;aacute;gina. Quando
respostas em uma discuss&amp;atilde;o est&amp;atilde;o abaixo
deste n&amp;iacute;vel, um aviso com o texto
&quot;&lt;em&gt;Some notes below your chosen depth have not been shown here&lt;/em&gt;&quot;

&amp;#91;NT: do ingl&amp;ecirc;s: &quot;&lt;i&gt;Algumas notas abaixo de sua
profundidade escolhida n&amp;atilde;o s&amp;atilde;o exibidas aqui&lt;/i&gt;&quot;&amp;#93;.
Para visualizar um &lt;i&gt;node&lt;/i&gt; abaixo desta profundidade, clique
sobre ele (ou em qualquer um dos &lt;i&gt;nodes&lt;/i&gt; abaixo deste,
na discuss&amp;atilde;o em que voc&amp;ecirc; est&amp;aacute; interessado)
para fazer dele o &lt;i&gt;node&lt;/i&gt; de mais alto n&amp;iacute;vel exibido.&lt;/p&gt;

&lt;p&gt;A op&amp;ccedil;&amp;atilde;o &lt;em&gt;Replies text depth&lt;/em&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;N.T.:Literalmente, &quot;Profundidade dos Textos
das Respostas&quot;&amp;#93;&lt;/font&gt; controla por quantos n&amp;iacute;veis abaixo
do n&amp;iacute;vel atual o texto do n&amp;oacute; ser&amp;aacute; exibido
na mesma p&amp;aacute;gina. Ser&amp;atilde;o exibidos apenas os
cabe&amp;ccedil;alhos (t&amp;iacute;tulo, autor, data, link)
sempre que o n&amp;iacute;vel for maior do que o ajustado em

&lt;em&gt;Replies text depth&lt;/em&gt;. Claro, nenhum n&amp;oacute; &amp;eacute;
exibido se seu n&amp;iacute;vel for abaixo do ajustado em 
&lt;em&gt;Replies text depth&lt;/em&gt;. Para exibir o texto de um n&amp;oacute;
em que o texto n&amp;atilde;o &amp;eacute; mostrado, clique sobre ele
( ou em qualquer um dos n&amp;oacute;s de mais baixo n&amp;iacute;vel
do &lt;i&gt;thread&lt;/i&gt; em que voc&amp;ecirc; est&amp;aacute; interessado) para 
torn&amp;aacute;-lo o n&amp;oacute; do topo do thread em uma nova tela.
A prop&amp;oacute;sito, a p&amp;aacute;gina de Prefer&amp;ecirc;ncias de
Usu&amp;aacute;rio &lt;font size=&quot;-2&quot;&gt;&amp;#91;User Settings&amp;#93;&lt;/font&gt;

permite que voc&amp;ecirc; ajuste a &lt;em&gt;Replies header depth&lt;/em&gt; 
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Profundidade de Cabe&amp;ccedil;alhos de
Resposta&amp;#93;&lt;/font&gt; abaixo da &lt;em&gt;Replies text depth&lt;/em&gt;,
caso em que a &lt;em&gt;Replies header depth&lt;/em&gt; tem preced&amp;ecirc;ncia.&lt;/p&gt;

&lt;p&gt;Por exemplo: &lt;em&gt;Replies header depth&lt;/em&gt; = 10 e
&lt;em&gt;Replies text depth&lt;/em&gt; = 2; a discuss&amp;atilde;o &amp;eacute; exibida
com 10 n&amp;iacute;veis de profundidade, mas apenas os dois
primeiros n&amp;iacute;veis exibem o texto real da discuss&amp;atilde;o;
os pr&amp;oacute;ximos 8 n&amp;iacute;veis apenas exibem as
informa&amp;ccedil;&amp;otilde;es do cabe&amp;ccedil;alho das respostas.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;theme&quot;&gt;&lt;/a&gt;Configura&amp;ccedil;&amp;atilde;o de Tema&lt;/h3&gt;

&lt;p&gt;A apar&amp;ecirc;ncia do site do PerlMonks &amp;eacute; modificada
pela escolha de um tema. Voc&amp;ecirc; pode ficar com o 
padr&amp;atilde;o ou escolher um tema especializado. O tema
&lt;em&gt;dark&lt;/em&gt; &lt;font size=&quot;-2&quot;&gt;&amp;#91;escuro&amp;#93;&lt;/font&gt; existe para
pessoas que preferem texto claro sobre fundo escuro. Escolher
outro tema que n&amp;atilde;o o padr&amp;atilde;o deixa mais f&amp;aacute;cil
lembrar se voc&amp;eirc; est&amp;aacute; &quot;logado&quot; no sistema ou n&amp;atilde;o.
&quot;&lt;em&gt;Monk Pictures off&lt;/em&gt;&quot; &lt;font size=&quot;-2&quot;&gt;&amp;#91;Fotografias dos Monges
desligado&amp;#93;&lt;/font&gt; desliga a fotografia rand&amp;ocirc;mica dos monges
exibida no alto &amp;agrave; direita de cada p&amp;aacute;gina, enquanto 
&quot;&lt;em&gt;Monk quips off&lt;/em&gt;&quot; &lt;font size=&quot;-2&quot;&gt;&amp;#91;Ditados dos Monges
desligado&amp;#93;&lt;/font&gt; desliga as cita&amp;ccedil;&amp;otilde;es curtas 
no alto &amp;agrave; esquerda da p&amp;aacute;gina.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;nonfront&quot;&gt;&lt;/a&gt;N&amp;oacute;s n&amp;atilde;o na Primeira P&amp;aacute;gina&lt;/h3&gt;

&lt;p&gt;Voc&amp;ecirc; pode ter um conjunto de n&amp;oacute;s para a primeira p&amp;aacute;gina e um outro conjunto diferente para todas as outras p&amp;aacute;ginas. Se voc&amp;ecirc; quiser reduzir o tempo de download do website ou n&amp;atilde;o usar os n&amp;oacute;s, voc&amp;ecirc; pode deslig&amp;aacute;-los em todas as p&amp;aacute;ginas exceto para o [Monastery Gates|Port&amp;otilde;es do Monast&amp;eacute;rio]. Apenas ligue a op&amp;ccedil;&amp;atilde;o de remo&amp;ccedil;&amp;atilde;o ao lado dos n&amp;oacute;s para remov&amp;ecirc;-los. Esta lista &amp;eacute; ignorada se voc&amp;ecirc; marcou &quot;&lt;em&gt;use my frontpage nodelets everywhere&lt;/em&gt;&quot; &lt;font size=&quot;-2&quot;&gt;&amp;#91;Use meus N&amp;oacute;s da Primeira P&amp;aacute;gina em todo lugar&amp;#93;&lt;/font&gt;. A ordem dos n&amp;oacute;s &amp;eacute; alterada usando os links &lt;em&gt;up&lt;/em&gt; &lt;font size=&quot;-2&quot;&gt;&amp;#91;para cima&amp;#93;&lt;/font&gt; e &lt;em&gt;down&lt;/em&gt; &lt;font size=&quot;-2&quot;&gt;&amp;#91;para baixo&amp;#93;&lt;/font&gt; pr&amp;oacute;ximos do nome de cada n&amp;oacute;. Uma interface alternativa para selecionar quais n&amp;oacute;s exibir e a sua ordem est&amp;aacute; dispon&amp;iacute;vel em [id://25185|Op&amp;ccedil;&amp;otilde;es de N&amp;oacute;].&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;misc&quot;&gt;&lt;/a&gt;Op&amp;ccedil;&amp;otilde;es Gerais&lt;/h3&gt;

&lt;ul&gt;

&lt;li&gt;&lt;i&gt;Show Unmoderated Content:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Exiba Conte&amp;uacute;do N&amp;atilde;o Moderado&amp;#93;&lt;/font&gt;
Se ativado, voc&amp;ecirc; pode ver todo o conte&amp;uacute;do, n&amp;atilde;o apenas 
os n&amp;oacute;s aprovados por moderadores.&lt;/li&gt;

&lt;li&gt;&lt;i&gt;All Nodelets Off:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Todos os N&amp;oacute;s Desligados&amp;#93;&lt;/font&gt;
Auto-explicativo, tem preced&amp;ecirc;ncia sobre os n&amp;oacute;s da
Primeira P&amp;aacute;gina bem como sobre os outros n&amp;oacute;s. Se voc&amp;ecirc;
ativar isso, todos os n&amp;oacute;s, em todo lugar, s&amp;atilde;o escondidos.&lt;/li&gt;

&lt;li&gt;&lt;i&gt;Large Code Font:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Fonte de C&amp;oacute;digo Grande&amp;#93;&lt;/font&gt;
Isto aumenta o tamanho da fonte de tudo o que for exibido 
entre tags &amp;lt;CODE&amp;gt;, para facilitar a leitura.&lt;/li&gt;

&lt;li&gt;&lt;i&gt;Turn Hints Off:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Desligar Dicas&amp;#93;&lt;/font&gt;
Dicas est&amp;atilde;o espalhadas pelo site para o benef&amp;iacute;cio
dos novos usu&amp;aacute;rios. Voc&amp;ecirc; pode ativar esta
op&amp;ccedil;&amp;atilde;o para se livrar delas.&lt;/li&gt;

&lt;li&gt;&lt;i&gt;/msg me when there's a reply to one of my posts:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Me envie uma mensagem quando houver respostas
 aos meus artigos.&amp;#93;&lt;/font&gt; Se voc&amp;ecirc; selecionar esta
op&amp;ccedil;&amp;atilde;o, o servidor lhe enviar&amp;aacute; uma mensagem
pessoal pelo &lt;em&gt;chatterbox&lt;/em&gt;&lt;sup&gt;[id://17323|&amp;#8594;]&lt;/sup&gt; sempre
que algu&amp;eacute;m responder diretamente a um de seus artigos.&lt;/li&gt;

&lt;li&gt;&lt;i&gt;Scratch Pad Public:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Bloco de Rascunho P&amp;uacute;blico&amp;#93;&lt;/font&gt;
Cada usu&amp;aacute;rio recebe uma &amp;aacute;rea de rascunho onde eles podem manter anota&amp;ccedil;&amp;otilde;es, postar trechos de c&amp;oacute;digo, ou manter qualquer outra informa&amp;ccedil;&amp;atilde;o que escolherem. Se esta op&amp;ccedil;&amp;atilde;o estiver ativa, outros usu&amp;aacute;rios poder&amp;atilde;o ver o conte&amp;uacute;do de seu Bloco de Rascunho digitando seu nome de usu&amp;aacute;rio no [id://108949|Visualizador do Bloco de Rascunho].&lt;/li&gt;

&lt;li&gt;&lt;i&gt;Override &amp;lt;readmore&amp;gt; tags:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Ignore Tags &lt;em&gt;ReadMore&lt;/em&gt;&amp;#93;&lt;/font&gt;
Usu&amp;aacute;rios devem inserir um tag &lt;em&gt;&amp;lt;readmore&amp;gt;&lt;/em&gt; em um artigo que cont&amp;eacute;m uma se&amp;ccedil;&amp;atilde;o de c&amp;oacute;digo comprida. Para manter o comprimento das p&amp;aacute;ginas menor em certas &amp;acute;reas do site, o restante do artigo ser&amp;aacute; substitu&amp;iacute;do por um link para o conte&amp;uacute;do completo do artigo. Marque esta op&amp;ccedil;&amp;atilde;o se voc&amp;ecirc; quiser ignorar tags &lt;em&gt;&amp;lt;readmore&amp;gt;&lt;/em&gt; e ver o texto completo em todos os lugares.&lt;/li&gt;

&lt;li&gt;&lt;i&gt;Note ordering:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Ordena&amp;ccedil;&amp;atilde;o de Artigos&amp;#93;&lt;/font&gt;
Voc&amp;ecirc; pode escolher ver as linhas de discuss&amp;atilde;o de artigos
tanto em ordem cronol&amp;oacute;gica ou ordenados por suas respectivas
reputa&amp;ccedil;&amp;otilde;es.

&lt;li&gt;&lt;i&gt;Code Wrapping Off:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Truncagem de c&amp;oacute;digo-fonte desligado&amp;#93;&lt;/font&gt;

Por padr&amp;atilde;o, o site vai truncar todo o conte&amp;uacute;do que aparecer entre tags &amp;lt;code&amp;gt; em 70 colunas (escorrendo o restante do texto para uma nova linha, imediatamente abaixo). Voc&amp;ecirc; pode desligar isso se quiser, mas o website pode perder sua forma e se tornar mais dif&amp;iacute;cil de ser lido, j&amp;aacute; que o c&amp;oacute;digo fonte vai ser exibido em sua largura original. Isso pode significar um monte de barras de deslizamento horizontal para mostrar o lado direito do website.

&lt;li&gt;&lt;i&gt;Code Wrap Length:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Comprimento da truncagem de c&amp;oacute;digo-fonte&amp;#93;&lt;/font&gt;

Voc&amp;ecirc; pode ajustar em que coluna deseja que o c&amp;oacute;digo-fonte seja truncado.

&lt;li&gt;&lt;i&gt;Auto Code Wrapping:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Truncagem de c&amp;oacute;digo-fonte autom&amp;aacute;tica&amp;#93;&lt;/font&gt;
Permite ao seu browser realizar a truncagem de c&amp;oacute;digo-fonte. Se esta op&amp;ccedil;&amp;atilde;o estiver ligada, o valor em &lt;i&gt;Code Wrap Length&lt;/i&gt; ser&amp;aacute; utilizado para inserir h&amp;iacute;fens em linhas longas e sem espa&amp;ccedil;os em branco onde quebrar o texto.


&lt;li&gt;&lt;i&gt;Code Prefix:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Prefixo de C&amp;oacute;digo-Fonte&amp;#93;&lt;/font&gt;
O que quer que voc&amp;ecirc; coloque aqui ser&amp;aacute; utilizado como prefixo para as linhas dentro de blocos &amp;lt;code&amp;gt;. Se voc&amp;ecirc; especificar alguma coisa no formato &lt;em&gt;/&amp;amp;\d+;/&lt;/em&gt;, ent&amp;atilde;o estes d&amp;iacute;gitos ser&amp;atilde;o incrementados para cada linha de c&amp;oacute;digo. Use &quot;&amp;001;:&amp;nbsp;&quot; para ter todas as linhas do c&amp;oacute;digo fonte numeradas.


&lt;li&gt;&lt;i&gt;Null vote:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Voto Nulo&amp;#93;&lt;/font&gt;
Isto se aplica apenas a membros com privil&amp;eacute;gios para votar.
Se voc&amp;ecirc; ligar esta op&amp;ccedil;&amp;atilde;o, ent&amp;atilde;o para cada artigo, o &lt;em&gt;radio button&lt;/em&gt; para voto nulo  &amp;eacute; exibido. Se voc&amp;ecirc; desligar isso, ent&amp;atilde;o haver&amp;atilde;o apenas dois bot&amp;otilde;es, ++ e --, e voc&amp;ecirc; ter&amp;aacute; de recarregar a p&amp;aacute;gina se escolher um destes e ent&amp;atilde;o decidir que n&amp;atilde;o deseja votar.


&lt;li&gt;&lt;i&gt;Disable JavaScript on homenodes:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Desabilite JavaScript nos N&amp;oacute;s de Usu&amp;aacute;rio&amp;#93;&lt;/font&gt;
Esta op&amp;ccedil;&amp;atilde;o tenta filtrar JavaScript quando voc&amp;ecirc; visita o &lt;em&gt;home node&lt;/em&gt; de algu&amp;eacute;m. As pessoas que mant&amp;ecirc;m o site n&amp;atilde;o utilizam JavaScript, de forma que voc&amp;ecirc; estar&amp;aacute; ainda mais seguro se desabilitar JavaScript em seu browser.


&lt;li&gt;&lt;i&gt;Perl Monks User Search Default Length:&lt;/i&gt; 
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Tamanho Padr&amp;atilde;o da Busca do Perl Monks&amp;#93;&lt;/font&gt;
Ajusta a quantidade de n&amp;oacute;s a exibir quando realizando uma busca em [id://6364].

&lt;li&gt;&lt;i&gt;Search finds nodes I can't read:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;A Busca encontra n&amp;oacute;s que eu n&amp;atilde;o posso ler&amp;#93;&lt;/font&gt;
Se isso estiver ligado, a [id://3989] listar&amp;aacute; n&amp;oacute;s que voc&amp;ecirc; pode n&amp;atilde;o ter permiss&amp;atilde;o suficiente para ver.


&lt;li&gt;&lt;i&gt;Format for date-times:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Formato para data e hora&amp;#93;&lt;/font&gt;
Permite que voc&amp;ecirc; utilize uma string de formato de data personalizado.
Este formato ser&amp;aacute; utilizado em todo lugar onde um hor&amp;aacute;rio for exibido. Qualquer formato para &lt;code&gt;strftime()&lt;/code&gt; pode ser especificado.

&lt;li&gt;&lt;i&gt;Show reaped nodes (in [Newest Nodes]):&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Exiba n&amp;oacute;s removidos (no [Newest Nodes|Novos N&amp;oacute;s])&amp;#93;&lt;/font&gt;

N&amp;oacute;s removidos n&amp;atilde;o aparecer&amp;atilde;o na sec&amp;ccedil;&amp;atilde;o [Newest Nodes|Novos N&amp;oacute;s] a n&amp;atilde;o ser que esta op&amp;ccedil;&amp;atilde;o esteja ligada.

&lt;li&gt;&lt;i&gt;No navigation menu under title bar:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Sem menu de navega&amp;ccedil;&amp;atilde;o sob a barra de t&amp;iacute;tulo&amp;#93;&lt;/font&gt;
Normalmente h&amp;aacute; uma lista de links que apontam para as diversas se&amp;ccedil;oes do Monast&amp;eacute;rio no topo de cada p&amp;aacute;gina. Ligar esta op&amp;ccedil;&amp;atilde;o faz com que as p&amp;aacute;ginas sejam geradas sem estes links.

&lt;/ul&gt;

&lt;h3&gt;&lt;a name=&quot;private&quot;&gt;&lt;/a&gt;Configura&amp;ccedil;&amp;otilde;es de Mensagens Privadas&lt;/h3&gt;

&lt;p&gt;Estas op&amp;ccedil;&amp;otilde;es controlam a exibi&amp;ccedil;&amp;atilde;o de mensagens privativas enviadas para voc&amp;ecirc; por outros usu&amp;aacute;rios do PerlMonks.&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;i&gt;Newest messages first:&lt;/i&gt;

&lt;font size=&quot;-2&quot;&gt;&amp;#91;Mensagens mais novas primeiro&amp;#93;&lt;/font&gt;
Esta op&amp;ccedil;&amp;atilde;o controla se as mensagens mais novas ou mais velhas ser&amp;atilde;o listadas no topo.

&lt;li&gt;&lt;i&gt;Max to display in inbox:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;N&amp;uacute;mero m&amp;aacute;ximo de mensagens exibidas no Inbox&amp;#93;&lt;/font&gt;
Ajusta a quantidade de mensagens privativas exibidas por p&amp;aacute;gina na caixa de entrada (Inbox).

&lt;li&gt;&lt;i&gt;Max to display in chatterbox&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;N&amp;uacute;mero m&amp;aacute;ximo de mensagens exibidas no ChatterBox&amp;#93;&lt;/font&gt;

Ajusta o n&amp;uacute;mero m&amp;aacute;ximo de mensagens exibidas no ChatterBox. Se houver mais mensagens, um link para o seu inbox ser&amp;aacute; exibido, dizendo o n&amp;uacute;mero de mensagens adicionais.
&lt;/ul&gt;

&lt;h3&gt;&lt;a name=&quot;sig&quot;&gt;&lt;/a&gt;Sua assinatura&lt;/h3&gt;

&lt;p&gt;Voc&amp;ecirc; pode usar HTML, links, caracteres especiais, etc. em sua assinatura. Ela ser&amp;aacute; carregada autom&amp;aacute;ticamente na caixa de edi&amp;ccedil;&amp;atilde;o quando voc&amp;ecirc; criar um artigo ou responder a algu&amp;eacute;m.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;titles&quot;&gt;&lt;/a&gt;Defini&amp;ccedil;&amp;atilde;o de T&amp;iacute;tulo de N&amp;oacute; Personalizado&lt;/h3&gt;

&lt;p&gt;Voc&amp;ecirc; pode personalizar o texto que aparece na barra de t&amp;iacute;tulo de seu broser aqui. Use os tokens %T, %N, %D e %S para inserir o t&amp;iacute;tulo do n&amp;oacute; atual, o seu n&amp;uacute;mero identificador, a data ou o nome da sec&amp;ccedil;&amp;atilde;o. O nome da sec&amp;ccedil;&amp;atilde;o aparecer&amp;aacute; apenas para n&amp;oacute;s de base, nunca para respostas ou coment&amp;acute;rios.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;styles&quot;&gt;&lt;/a&gt;Op&amp;ccedil;&amp;otilde;es de Folha de Estilo&lt;/h3&gt;

&lt;p&gt;Em adi&amp;ccedil;&amp;atilde;o aos temas acima, voc&amp;ecirc; pode alterar o aspecto do site do PerlMonks com suas pr&amp;oacute;prias folhas de estilo em cascata (CSS).&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;i&gt;Link to external CSS stylesheet:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Link para uma folha de estilo CSS externa&amp;#93;&lt;/font&gt;

Voc&amp;ecirc; pode se referir a uma folha de estilo em outro servidor da rede colocando o URL da folha de estilo aqui. Esta folha de estilo ser&amp;aacute; carregada depois de quaisquer folhas de estilo especificadas pelo seu tema selecionado.
 You can link

&lt;li&gt;&lt;i&gt;On-Site CSS Markup:&lt;/i&gt; 
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Formata&amp;ccedil;&amp;atilde;o CSS '&lt;i&gt;in loco&lt;/i&gt;'&amp;#93;&lt;/font&gt;
Qualquer c&amp;oacute;digo CSS que voc&amp;ecirc; colocar aqui ser&amp;aacute; inserido em todas as p&amp;aacute;ginas que voc&amp;ecirc; visitar.


&lt;li&gt;&lt;i&gt;Link to CSS stylesheet for print display type:&lt;/i&gt;
&lt;font size=&quot;-2&quot;&gt;&amp;#91;Link para a folha de estilo para impressora:&amp;#93;&lt;/font&gt;
No topo de cada p&amp;aacute;gina, bem abaixo do t&amp;iacute;tulo, existem dois links etiquetados &quot;print&quot; &amp;#91;&lt;i&gt;imprimir&lt;/i&gt;&amp;#93; e &quot;xml&quot;. O link &quot;print&quot; recomp&amp;otilde;e a p&amp;aacute;gina atual em um formato bom para imprimir. Voc&amp;ecirc; pode alterar este formato especificando uma folha de estilo para usar quando exibindo documentos para impress&amp;atilde;o.
&lt;/ul&gt;

&lt;h3&gt;&lt;a name=&quot;personal&quot;&gt;&lt;/a&gt;Construindo seu &lt;i&gt;Personal Nodelet&lt;/i&gt; &amp;#91;&lt;i&gt;N&amp;oacute; Pessoal&lt;/i&gt;&amp;#93;&lt;/h3&gt;

&lt;p&gt;Seu n&amp;oacute; pessoal &amp;eacute; como uma pasta de Bookmarks no PerlMonks. Dentro dele, voc&amp;ecirc; pode ver um link como &lt;em&gt;&lt;tt&gt;add &quot;Whatever&quot;&lt;/tt&gt;&lt;/em&gt; &amp;#91;&lt;i&gt;adicionar &quot;nome-do-n&amp;oacute;&quot;&lt;/i&gt;&amp;#93;. Para adicionar um &lt;i&gt;bookmark&lt;/i&gt; em seu n&amp;oacute; pessoal, apenas clique neste link enquanto voc&amp;ecirc; estiver na p&amp;aacute;gina que deseja adicionar.&lt;/p&gt;

&lt;p&gt;Se desejar mudar o conte&amp;uacute;do de seu &lt;i&gt;personal nodelet&lt;/i&gt;, a partir da sua p&amp;aacute;gina de op&amp;ccedil;&amp;otilde;es de usu&amp;aacute;rio, marque a op&amp;ccedil;&amp;atilde;o &quot;Modify Personal Nodelet&quot; &amp;#91;&lt;i&gt;Modificar o N&amp;oacute; Pessoal&lt;/i&gt;&amp;#93;. Para remover links de seu &lt;i&gt;Personal Nodelet&lt;/i&gt;, marque a op&amp;ccedil;&amp;atilde;o &quot;&lt;i&gt;remove&lt;/i&gt;&quot; pr&amp;oacute;xima aos links que deseja remover. Voc&amp;ecirc; pode tamb&amp;eacute;m adicionar novos &amp;iacute;tens, escrevendo o t&amp;iacute;tulo do n&amp;oacute; na caixa &quot;Add&quot; &amp;#91;&lt;i&gt;Adicionar&lt;/i&gt;&amp;#93;.&lt;/p&gt;

&lt;h3&gt;&lt;a name=&quot;#newest&quot;&gt;&lt;/a&gt;Clear my newest nodes flag &amp;#91;&lt;i&gt;Op&amp;ccedil;&amp;atilde;o &quot;Limpar minha lista de n&amp;oacute;s mais recentes&lt;/i&gt;&amp;#93;&lt;/h3&gt;

&lt;p&gt;Voc&amp;ecirc; pode usar a p&amp;aacute;gina dos [Newest Nodes|N&amp;oacute;s Mais Recentes] para manter uma lista de novidades do site. Inicialmente aquela p&amp;aacute;gina mostrar&amp;aacute; todos os n&amp;oacute;s criados durante o dia anterior. Depois de ler todos os n&amp;oacute;s listados, voc&amp;ecirc; pode pressionar o bot&amp;atilde;o &quot;I've seen all of these&quot; &amp;#91;&lt;i&gt;J&amp;aacute; vi todos estes&lt;/i&gt;&amp;#93; e o PerlMonks vai salvar o hor&amp;aacute;rio 

You can use the [Newest Nodes] page to keep track of new
nodes on the site.  Initially that page will list all nodes
created during the previous day.  After reading all of the nodes of interest
listed there, you can press the button labeled &quot;I've seen all
of these&quot; and PerlMonks will save the timestamp of the newest
node on that list before presenting newer nodes.  The next time
you go back to [Newest Nodes], it will present a list of nodes
created since that timestamp.  To clear the timestamp and make
[Newest Nodes] show the last day's worth of nodes, press the
button labeled &quot;Clear my newest nodes flag&quot;.&lt;/p&gt;

&lt;hr/&gt;
&lt;i&gt;Back to [PerlMonks FAQ]&lt;/i&gt;</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>335886</node_id>
  <author_user>17342</author_user>
  <title>Como eu altero minhas prefer&#234;ncias?</title>
  <createtime>2004-03-11 12:25:11</createtime>
  <nodeupdated>2005-08-12 16:52:03</nodeupdated>
</node>
