<node>
  <doctext>&lt;!-- 2003-08-14 - [monsieur_champs] - Translated to pt_BR --&gt;
&lt;!-- 2003-05-16 Louis_Wu changed &quot;Perl Monks&quot; to &quot;PerlMonks&quot;, added footer, changed link to id: --&gt;
&lt;!--ailie, 4/5/02--&gt;
&lt;h1&gt;Criando uma conta no PerlMonks&lt;/h1&gt;

&lt;p align=&quot;right&quot;&gt;&lt;i&gt;This is a translation of the &quot;[id://156908]&quot; node.&lt;/i&gt;&lt;/p&gt;

&lt;p&gt;Embora voc&amp;ecirc; n&amp;atilde;o precise criar uma para postar no PerlMonks, criar uma permite associar seus artigos a voc&amp;ecirc;. Com o tempo, voc&amp;ecirc; pode ganhar pontos de experi&amp;ecirc;ncia e subir na hierarquia do PerlMonks. Voc&amp;ecirc; tamb&amp;eacute;m pode editar seus artigos e receber notifica&amp;ccedil;&amp;otilde;es quando algu&amp;eacute;m responder a algum dos seus artigos.&lt;/p&gt;

&lt;p&gt;Para criar uma conta, clique no link [id://101|Create a New User], debaixo da caixa de login, no topo &amp;agrave; direita desta p&amp;aacute;gina. Voc&amp;ecirc; ser&amp;aacute; levado para uma p&amp;aacute;gina onde poder&amp;aacute; preencher seu &lt;i&gt;username&lt;/i&gt; preferido, seu nome verdadeiro e seu endere&amp;ccedil;o de email. Seu nome real e seu endere&amp;ccedil;o de email n&amp;atilde;o ser&amp;atilde;o publicamente acess&amp;iacute;veis. Seu endere&amp;ccedil;o de email serve apenas para o envio de sua senha; voc&amp;ecirc; n&amp;atilde;o receber&amp;aacute; emails do website ou &lt;i&gt;spam&lt;/i&gt;. Uma vez preenchido todo o formul&amp;aacute;rio, pressione o bot&amp;atilde;o &quot;&lt;i&gt;submit&lt;/i&gt;&quot;.&lt;/p&gt;
&lt;p&gt;Se o &lt;I&gt;username&lt;/i&gt; escolhido por voc&amp;ecirc; estiver dispon&amp;iacute;vel, voc&amp;ecirc; ver&amp;aacute; ent&amp;atilde;o uma p&amp;aacute;gina dizendo &quot;&lt;i&gt;Your new user account (username) has been created. You (email address) should be getting an email soon telling you your generated password.&lt;/i&gt;&quot; &amp;#91;Literalmente: &quot;Sua nova conta de usu&amp;aacute;rio (&lt;i&gt;username&lt;/i&gt;) foi criada. Seu (&lt;i&gt;endere&amp;ccedil;o de email&lt;/i&gt;) receber&amp;aacute; em breve uma mensagem dizendo a sua senha gerada automaticamente.&quot;&amp;#93;&lt;/p&gt;

&lt;p&gt;Se o &lt;i&gt;username&lt;/i&gt; requisitado n&amp;atilde;o estiver dispon&amp;iacute;vel, voc&amp;ecirc; voc&amp;ecirc; ver&amp;aacute; uma p&amp;aacute;gina dizendo &quot;&lt;I&gt;Sorry, your username clashes with (username) which already exists. Pick a variation, or try another name...&lt;/i&gt;&quot; &amp;#91;Literalmente: &quot;Desculpe, seu &lt;i&gt;username&lt;/i&gt; conflita com (&lt;i&gt;username&lt;/i&gt;) que j&amp;aacute; existe. Escolha uma varia&amp;ccedil;&amp;atilde;o, ou tente outro nome...&quot;&amp;#93;. Neste caso, voc&amp;ecirc; deve escolher outro &lt;i&gt;username&lt;/i&gt; e pressionar o bot&amp;atilde;o &quot;&lt;i&gt;submit&lt;/i&gt;&quot; para tentar novamente.&lt;/p&gt;

&lt;HR&gt;&lt;i&gt;Voltar para o [PerlMonks FAQ]&lt;/i&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>370943</node_id>
  <author_user>17342</author_user>
  <title>Criando uma conta no PerlMonks</title>
  <createtime>2003-08-15 13:30:04</createtime>
  <nodeupdated>2005-08-10 22:16:30</nodeupdated>
</node>
