<node>
  <doctext>&lt;!-- 2004-09-23 [jdporter] Removed Craft and the FAQ thing at the end. Added PMD, Snippets, Q&amp;A, News, Reviews, NN, Offering Plate. Rearranged to the same order as in the &quot;menu bar&quot;.
However, even though the order is the now the same as on the menu bar, the titles are drawn directly from the nodes.  The most egregious case is &quot;Q&amp;A&quot;.  Can we rely on the novice to connect the name of the section listed here with the link in the menu bar? --&gt;
&lt;!-- 2004-10-26 [monsieur_champs] translated to pt_BR --&gt;

&lt;h1&gt;O Guia dos Monges Perl para o Mosteiro&lt;/h1&gt;
&lt;p align=&quot;right&quot;&gt; &lt;small&gt; &lt;i&gt; This node is a translation of &quot;[id://972]&quot;.&lt;/i&gt; &lt;/small&gt; &lt;/p&gt;

&lt;p&gt;
  Bem-vindo ao Mosteiro Perl. N&amp;oacute;s esperamos que sua
  estada seja longa e agrad&amp;aacute;vel. Voc&amp;ecirc; est&amp;aacute;
  provavelmente se perguntando sobre o que o PerlMonks fala.
  Esperan&amp;ccedil;osamente esta p&amp;aacute;gina responder&amp;aacute;
  algumas destas quest&amp;otilde;es.
&lt;/p&gt;

&lt;h3&gt;O que &amp;eacute; o PerlMonks:&lt;/h3&gt;

&lt;ul&gt;

  &lt;li&gt;Nossa tentativa de fazer o aprendizado de Perl o mais n&amp;atilde;o-intimidante e f&amp;aacute;cil de usar poss&amp;iacute;vel.&lt;/li&gt;

  &lt;li&gt;Um lugar para voc&amp;ecirc; e os outros polir, incrementar e exibir suas habilidades com Perl.&lt;/li&gt;

  &lt;li&gt;Uma comunidade que permite a todos crescer e aprender dos outros.&lt;/li&gt;

&lt;/ul&gt;


&lt;h3&gt;&amp;Aacute;reas neste Mosteiro:&lt;/h3&gt;

&lt;!-- According to the &quot;menu bar&quot;:

 131	The Monastery Gates
 3989	Super Search

 479	Seekers of Perl Wisdom
 480	Meditations
 1040	Perl Monks Discussion			PerlMonks Discussion
 148	Library
 1597	Obfuscated code				Obfuscation
 1590	Perl Poetry				Poetry
 1044	Cool Uses For Perl
 1967	Snippets Section			Snippets
 1747	Code Catacombs				Code
 1843	Categorized Questions and Answers	Q&amp;A
 23771	Perl News
 21144	Reviews
 954	Tutorials
 3628	Newest Nodes
 71130	Offering Plate

--&gt;


&lt;ul&gt;

  &lt;li&gt;
    [id://479] (&lt;i&gt;Peregrinos por Sabedoria Perl&lt;/i&gt;) -
    O lugar onde voc&amp;ecirc; ir&amp;aacute; quando tiver uma pergunta
    sobre como fazer alguma coisa ou n&amp;atilde;o tem certeza sobre
    por qu&amp;ecirc; algo n&amp;atilde;o est&amp;aacute; funcionando. Ent&amp;atilde;o
    outros Monges Perl poder&amp;atilde;o oferecer a voc&amp;ecirc;
    sabedoria e sugest&amp;otilde;es.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://480] (&lt;i&gt;Medita&amp;ccedil;&amp;otilde;es&lt;/i&gt;) -
    Voc&amp;ecirc; encontrou alguma coisa impressionante sobre Perl,
    e deseja partilhar com todo mundo? Voc&amp;ecirc; teve uma epifania
    de Perl ou encontrou alguma coisa no Perl que abriu sua mente?
    Este &amp;eacute; o lugar para estes pequenos truques bacanas e
    descobertas impressionantes.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://1040] (&lt;i&gt;Discuss&amp;otilde;es dos Monges Perl&lt;/i&gt;) - 
    Para discuss&amp;otilde;es relacionadas especificamente a este
    &lt;i&gt;web site&lt;/i&gt;, e como as coisas funcionam aqui. Por exemplo,
    se voc&amp;ecirc; pensa que o Mosteiro pode ser melhorado de alguma
    forma em particular, coloque isto em discuss&amp;atilde;o aqui.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://148] (&lt;i&gt;Biblioteca&lt;/i&gt;) -
    Este &amp;eacute; o lugar para encontrar toda a documenta&amp;ccedil;&amp;atilde;o
    de Perl que voc&amp;ecirc; precisar.
    &lt;!-- Aqui, agora, n&amp;atilde;o existe outro lugar que eu queira estar...
    Neste momento n&amp;oacute;s temos as p&amp;aacute;ginas b&amp;acute;sicas do manual
    para o n&amp;uacute;cleo da lingagem. Isto vai crescer, no futuro, para
    incluir documenta&amp;ccedil;&amp;atilde;o para os m&amp;oacute;dulos mais
    freq&amp;uuml;entemente utilizados.
    --&gt;
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://1597] (&lt;i&gt;C&amp;oacute;digo Obfuscado&lt;/i&gt;) -
	Tem c&amp;oacute;digo-fonte que precisaria de um
	Gr&amp;atilde;o-Mestre em Perl para entender? Coloque-o aqui para
	que n&amp;oacute;s possamos observ&amp;aacute;-lo antes de tentar
	rodar e descobrir o que ele faz.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://1590] (&lt;i&gt;Poesia Perl&lt;/i&gt;) - O nome diz quase tudo.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://1044] (&lt;i&gt;Usos Legais para Perl&lt;/i&gt;) -
    Voc&amp;ecirc; automatizou uma parte da sua vida que n&amp;atilde;o
    seria poss&amp;iacute;vel sem o poder do Perl? Voc&amp;ecirc; usa Perl
    para fazer alguma coisa &amp;uacute;nica e divertida, que est&amp;aacute; convencido
    de que ningu&amp;eacute;m pensou? Nos conte sobre isso!
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://1967] (&lt;i&gt;Trechos de C&amp;oacute;digo&lt;/i&gt;) - 
    Voc&amp;ecirc; escreveu alguma coisa esperta que &amp;eacute; incrivelmente
    &amp;uacute;til, mas dif&amp;iacute;cil de escrever da primeira vez? Adicione
    isto aqui para que outras pessoas possam se beneficiar e aprender disto.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://1747] (&lt;i&gt;Catacumbas de C&amp;oacute;digo&lt;/i&gt;) -
    O lugar para colocar seus programas completos e scripts que outros podem achar &amp;uacute;teis.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt; &lt;!-- Q&amp;A --&gt;
    [id://1843] (&lt;i&gt;Perguntas e Respostas Categorizadas&lt;/i&gt;) - 
    Seu pr&amp;oacute;prio, sempre crescente comp&amp;ecirc;ndio de quest&amp;oacute;es
    &quot;frequentemente perguntadas&quot; relacionadas com Perl, e suas respostas.
    Se voc&amp;ecirc; se encontrou com um problema e est&amp;aacute; inclinado a
    pensar &quot;Tenho certeza de que isto j&amp;aacute; foi resolvido uma centena
    de vezes antes&quot;, ent&amp;atilde;o verifique aqui antes de postar sua
    pergunta para o [id://479|Peregrinos por Sabedoria Perl].
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt; &lt;!-- News --&gt;
    [id://23771] (&lt;i&gt;Not&amp;iacute;cias&lt;/i&gt;) - 
    Not&amp;iacute;cias relevantes e an&amp;uacute;ncios da Comunidade Perl.
    Coloca juntos &amp;iacute;tens de fontes como
    [http://use.perl.org/|use Perl;] e [http://www.perl.com/|O'Reilly].
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt; &lt;!-- Reviews --&gt;
    [id://21144] (&lt;i&gt;Resenhas&lt;/i&gt;) - 
    Se voc&amp;ecirc; est&amp;aacute; pensando em utilizar aquele M&amp;oacute;dulo Perl ou comprar aquele livro que satisfaz exatamente suas necessidades, leia estas resenhas -- escritas pelos seus colegas Monges do Perl -- para te ajudar a tomar uma decis&amp;atilde;o informada.
    &lt;br/&gt;
    Por outro lado, se voc&amp;ecirc; usou um m&amp;oacute;dulo ou leu um livro, e acha que outros Monges do Perl podem se beneficiar das suas experi&amp;ecirc;ncias, por favor as partilhe aqui escrevendo uma resenha!
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt;
    [id://954|Tutoriais] - 
    Um sempre-crescente livro-texto &lt;i&gt;online&lt;/i&gt;, de onde voc&amp;ecirc; pode aprender os b&amp;aacute;sicos do perl ou alguma coisa legal que n&amp;atilde;o tentou antes. Se voc&amp;ecirc; tem uma id&amp;eacute;ia para um tutorial, ou gostaria de escrever um voc&amp;ecirc; mesmo, por favor fa&amp;ccedil;a com que [gods|n&amp;oacute;s] saibamos.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt; &lt;!-- NN --&gt;
    [id://3628|Novos N&amp;oacute;s] -
    Uma listagem atualizada minuto-a-minuto de todos os n&amp;oacute;s que foram criados desde &quot;a &amp;uacute;ltima vez que voc&amp;ecirc; olhou&quot;.
  &lt;/li&gt;&lt;br/&gt;

  &lt;li&gt; &lt;!-- Offering Plate --&gt;
    [id://71130|Prato de Ofertas] - 
    Se voc&amp;ecirc; achou que este lugar pode te ajudar, voc&amp;ecirc; pode mostrar sua aprecia&amp;ccedil;&amp;atilde;o ajudando a manter este site rodando nos pr&amp;oacute;ximos anos.
  &lt;/li&gt;&lt;br/&gt;

&lt;/ul&gt;


&lt;p&gt;Uma vis&amp;atilde;o mais aprofundada est&amp;aacute; dispon&amp;iacute;vel em [id://237057]&lt;/p&gt;
&lt;hr/&gt;
&lt;i&gt;Voltar para [PerlMonks FAQ]&lt;/i&gt;


</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>406650</node_id>
  <author_user>17342</author_user>
  <title>O Guia dos Monges Perl para o Mosteiro</title>
  <createtime>2004-11-10 07:02:22</createtime>
  <nodeupdated>2005-08-12 15:28:07</nodeupdated>
</node>
