<node>
  <doctext>&lt;!-- 2003-05-23 - Mr. Muskrat - link FAQ by id --&gt;
  &lt;!-- 2003-05-20 - pfaut - initial version --&gt;
  &lt;!-- 2003-07-17 - Monsieur_Champs - Traslation to PT_BR --&gt;
  &lt;p align=&quot;right&quot;&gt;&lt;b&gt;&lt;i&gt;This is a translation from the &quot;[id://243874]&quot;&lt;/i&gt;&lt;/b&gt;&lt;/p&gt;

  &lt;p&gt;Algumas das quest&amp;otilde;es enviadas para o monast&amp;eacute;rio acabam respondidas com algo como &quot;Fa&amp;ccedil;a sua pr&amp;oacute;pria li&amp;ccedil;&amp;atilde;o de casa!&quot;. Pode ser que algumas pessoas postem problemas similares ao mesmo tempo. Ou o problema pode ser transcrito de forma que se reduza a &quot;eu preciso de um programa para fazer X. Voc&amp;ecirc; poderia escrev&amp;ecirc;-lo para mim? Aqui tem meu endere&amp;ccedil;o de email.&quot; Alguns n&amp;atilde;o s&amp;atilde;o t&amp;atilde;o &amp;oacute;bvios.&lt;/p&gt;

  &lt;p&gt;A maior parte dos monges n&amp;atilde;o gosta de fazer li&amp;ccedil;&amp;atilde;o de casa para voc&amp;ecirc;. Algumas das raz&amp;otilde;es s&amp;atilde;o:
    
    &lt;ul&gt;
      &lt;li&gt;eles acham que voc&amp;ecirc; aprenderia mais fazendo a li&amp;ccedil;&amp;atilde;o voc&amp;ecirc; mesmo&lt;/li&gt; 
      &lt;li&gt;eles sentem-se insultados por que voc&amp;ecirc; pensa que o seu tempo &amp;eacute; mais valioso do que o deles&lt;/li&gt; 
      &lt;li&gt;eles acham que voc&amp;ecirc; n&amp;atilde;o respeita o esfor&amp;ccedil;o que eles colocam em aprender o que sabem, pedindo a eles que lhe enviem respostas prontas&lt;/li&gt; 
    &lt;/ul&gt;

    &lt;p&gt;Por outro lado, alguns monges n&amp;atilde;o se importam em ajudar voc&amp;ecirc; com sua li&amp;ccedil;&amp;atilde;o de casa, desde que voc&amp;ecirc;:&lt;/p&gt;
    
    &lt;ul&gt;
      &lt;li&gt;indique que isto &amp;eacute; li&amp;ccedil;&amp;atilde;o de casa antes&lt;/li&gt;
      &lt;li&gt;poste sua tentativa de um programa para resolver a tarefa&lt;/li&gt;
      &lt;li&gt;pergunte quest&amp;otilde;es espec&amp;iacute;ficas para superar obst&amp;aacute;culos espec&amp;iacute;ficos&lt;/li&gt; 
    &lt;/ul&gt;
    
    &lt;p&gt;Ao inv&amp;eacute;s de postar um pedido de ajuda com li&amp;ccedil;&amp;atilde;o de casa, tente resolver o problema sozinho, usando estes recursos:&lt;/p&gt;

    &lt;ul&gt;
      &lt;li&gt;Pegue alguns livros de perl. Os da [http://perl.oreilly.com/|O'Reilly books] s&amp;atilde;o muito bem cotados. Alguns livros de perl podem ser adquiridos na [http://search.barnesandnoble.com/booksearch/results.asp?WRD=perl|Barnes and Noble] e outras livrarias.&lt;/li&gt;
      &lt;li&gt;Use o programa [perldoc] no seu sistema para procurar por documenta&amp;ccedil;&amp;atilde;o sobre perl.&lt;/li&gt;
      &lt;li&gt;Use o [http://perldoc.perl.org/] online para procurar por documenta&amp;ccedil;&amp;atilde;o sobre perl.&lt;/li&gt;
      &lt;li&gt;Use o [Super Search] para saber como outras pessoas resolveram problemas parecidos.&lt;/li&gt;
      &lt;li&gt;Procure nos [Tutorials|Tutoriais] por artigos que cobrem a &amp;aacute;rea do seu problema.&lt;/li&gt;
    &lt;/ul&gt;
    
    &lt;hr /&gt;&lt;i&gt;voltar para o [PerlMonks FAQ]&lt;/i&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>370946</node_id>
  <author_user>17342</author_user>
  <title>O Perl Monks &#233; um bom lugar para obter respostas para sua li&#231;&#227;o de casa?</title>
  <createtime>2003-07-17 14:32:32</createtime>
  <nodeupdated>2005-08-10 21:28:02</nodeupdated>
</node>
