<node>
  <doctext>&lt;!-- 2003-03-17 - boo_radley - created placeholder --&gt;
&lt;!-- 2003-05-09 - Mr. Muskrat - 0.1 - new document --&gt;
&lt;!-- 2003-06-11 - Monsieur Champs - translation to PT_BR --&gt;
&lt;h1&gt;O que &amp;eacute; o PerlMonks?&lt;/h1&gt;
&lt;p align=&quot;right&quot;&gt;&lt;i&gt;This is a translation from the [id://243870] node.&lt;/i&gt;&lt;/p&gt;
&lt;p&gt;[vroom] certa vez &lt;a href=&quot;http://www.pair.com/pair/current/insider/1201/damianconway.html&quot;&gt;disse&lt;/a&gt;  que o PerlMonks &amp;eacute;:&lt;br /&gt;
&lt;ul&gt;
  &lt;li&gt;uma tentativa de transformar o aprendizado de Perl em algo n&amp;atilde;o intimidante e acess&amp;iacute;vel.&lt;/li&gt;
  &lt;li&gt;um lugar para lapidar, incrementar e demonstrar suas habilidades em Perl&lt;/li&gt;
  &lt;li&gt;uma comunidade que permite a qualquer pessoa crescer e aprender com as outras&lt;/li&gt;
&lt;/ul&gt;

  &lt;p&gt;[nate] &lt;a href=&quot;http://webdevelopment.developersnetwork.com/Articles.asp?Article=100&quot;&gt;disse&lt;/a&gt; o seguinte sobre o PerlMonks:&lt;br /&gt;
  &lt;ul&gt;
    &lt;li&gt;N&amp;oacute;s visamos um ponto de encontro legal na Internet para Gurus Perl e usu&amp;aacute;rios semi-avan&amp;ccedil;ados.&lt;/li&gt;
    &lt;li&gt;N&amp;oacute;s precisamos oferecer um ambiente onde as pessoas possam fazer perguntas, enviar seus melhores trabalhos, e basicamente serem &lt;i&gt;geeks&lt;/i&gt; de Perl.&lt;/li&gt;
    &lt;li&gt;Meu primeiro cargo oficial na compania foi &quot;Monge Perl&quot;. Eu acho que gostei da filosofia por tr&amp;aacute;s de ser um monge. Existe uma conota&amp;ccedil;&amp;atilde;o religiosa, e o Perl &amp;eacute; uma linguagem que algumas pessoas levam &amp;agrave; s&amp;eacute;rio como uma religi&amp;atilde;o. Mosteiros s&amp;atilde;o culturalmente conhecidos como centros de aprendizado e conhecimento, e essa &amp;eacute; uma boa analogia do que estamos tentando construir.&lt;/li&gt;
    &lt;li&gt;Eventualmente, todas as perguntas que as pessoas fazem compor&amp;atilde;o um tremendo arquivo de documenta&amp;ccedil;&amp;atilde;o no estilo &quot;perguntas e respostas&quot; e n&amp;oacute;s trabalharemos em meios de tornar tudo isso mais acess&amp;iacute;vel para as pessoas.&lt;/li&gt;
  &lt;/ul&gt;
  &lt;/p&gt;</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>272361</node_id>
  <author_user>17342</author_user>
  <title>O que &#233; o PerlMonks?</title>
  <createtime>2003-07-08 13:53:05</createtime>
  <nodeupdated>2005-08-12 14:23:43</nodeupdated>
</node>
