<node>
  <doctext>&lt;!--
2003-03-20 [boo_radley] crosslinked, added perl doc site
2003-05-24 [Mr. Muskrat] s/Perl Monks/PerlMonks/; changed to id link
2003-08-12 [Monsieur_Champs] Translated to pt_br
2004-10-26 [Monsieur_Champs] Revision 1.1
--&gt;

&lt;H2&gt;Onde a fun&amp;ccedil;&amp;atilde;o &lt;code&gt;xxx()&lt;/code&gt; est&amp;aacute; documentada?&lt;/h2&gt;

&lt;p align=&quot;right&quot;&gt;&lt;i&gt;This is a translation from the &quot;[id://17404]&quot; node.&lt;/i&gt;&lt;/p&gt;

&lt;p&gt;Sua instala&amp;ccedil;&amp;atilde;o do Perl vem com toda a documenta&amp;ccedil;&amp;atilde;o que voc&amp;ecirc; poderia possivelmente precisar. (Isso surpreende um monte de pessoas iniciantes no Perl). Nos sistemas UNIX e semelhantes (como o linux), a documenta&amp;ccedil;&amp;atilde;o est&amp;aacute; toda dispon&amp;iacute;vel em &lt;tt&gt;perldoc&lt;/tt&gt;. Perl para outros sistemas operacionais oferece a mesma documenta&amp;ccedil;&amp;atilde;o em v&amp;aacute;rios formatos, mas procurando sob o diret&amp;oacute;rio onde seu interpretador perl est&amp;aacute; instalado voc&amp;ecirc; deve encontrar as respostas para todas as quest&amp;otilde;es b&amp;aacute;sicas. Por exemplo, &lt;tt&gt;perldoc perlfunc&lt;/tt&gt; em um sistema UNIX deve responder a voc&amp;ecirc; a quest&amp;atilde;o formulada no t&amp;iacute;tulo deste FAQLet.&lt;/p&gt;

&lt;p&gt;Se voc&amp;ecirc; vir c&amp;oacute;digo-fonte no PerlMonks, tamb&amp;eacute;m ver&amp;aacute; o &quot;function nodelet&quot; no lado direito, que tem links para a documenta&amp;ccedil;&amp;atilde;o de cada fun&amp;ccedil;&amp;atilde;o no c&amp;oacute;digo-fonte. Nota: esta documenta&amp;ccedil;&amp;atilde;o pode n&amp;atilde;o corresponder &amp;agrave; vers&amp;atilde;o do Perl que voc&amp;ecirc; tem instalada.&lt;/p&gt;

&lt;p&gt;Para mais informa&amp;ccedil;&amp;otilde;es, tente ler o [perlman:perlfaq|Perl FAQ] (&lt;i&gt;em ingl&amp;ecirc;s&lt;/i&gt;).&lt;/p&gt;

&lt;p&gt;Se voc&amp;ecirc; quiser procurar pela documenta&amp;ccedil;&amp;atilde;o de uma determinada fun&amp;ccedil;&amp;atilde;o no website, basta escrever o nome da fun&amp;ccedil;&amp;atilde;o desejada no &lt;i&gt;search box&lt;/i&gt;. Uma c&amp;oacute;pia um pouco desatualizada da documenta&amp;ccedil;&amp;atilde;o online padr&amp;atilde;o do Perl pode ser encontrada aqui, na [Library|Biblioteca].

&lt;HR&gt;&lt;i&gt;Voltar para o [PerlMonks FAQ]&lt;/i&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>283274</node_id>
  <author_user>17342</author_user>
  <title>Onde a fun&#231;&#227;o xxx() est&#225; documentada?</title>
  <createtime>2003-08-12 13:22:49</createtime>
  <nodeupdated>2005-08-12 13:16:48</nodeupdated>
</node>
