<node>
  <doctext>&lt;!-- 2003-03-13 - pfaut - 0.1 - new document --&gt;
&lt;!-- 2003-04-18 - pfaut - 0.2
     added description of 'disable javascript on homenodes' option
     changed status to 'beta' --&gt;
&lt;!-- 2003-07-18 - Monsieur_Champs - Translation to pt_br --&gt;
&lt;p align=&quot;right&quot;&gt;&lt;i&gt;&lt;b&gt;Translated to pt_br from the &quot;[id://242931]&quot; node.&lt;/b&gt;&lt;/i&gt;&lt;/p&gt;

&lt;p&gt;Existem algumas quest&amp;otilde;es inerentes sobre seguran&amp;ccedil;a envolvidas quando navegamos com JavaScript ligado. Este documento tenta mostrar onde estes perigos se escondem no website do PerlMonks.org.&lt;/p&gt;

&lt;p&gt;O PerlMonks n&amp;atilde;o usa JavaScript. Toda a formata&amp;ccedil;&amp;atilde;o gerada pelo site &amp;eacute; ou HTML ou CSS.&lt;/p&gt;

&lt;p&gt;Os usu&amp;aacute;rios criam conte&amp;uacute;do para o site. HTML adicionado por usu&amp;aacute;rios &amp;eacute; conferido contra uma lista de &lt;i&gt;tags&lt;/i&gt; e atributos [id://29281|&amp;#8594;] para tentar bloquear scripts.&lt;/p&gt;

&lt;p&gt;Entretanto, usu&amp;aacute;rios podem adicionar qualquer coisa em seus &lt;i&gt;homenodes&lt;/i&gt;. Como qualquer coisa na p&amp;aacute;gina pode reagir a eventos '&lt;code&gt;onClick&lt;/code&gt;' ou '&lt;code&gt;onMouseOver&lt;/code&gt;', at&amp;eacute; mesmo coisas que parecem benignas podem ativar alguma a&amp;ccedil;&amp;atilde;o em script.&lt;/p&gt;

&lt;p&gt;Alguns usu&amp;aacute;rios que tem JavaScript em seus &lt;i&gt;home nodes&lt;/i&gt; o utilizam para enviar avisos aos passantes dizendo que JavaScript pode ser perigoso. Algumas vezes uma mensagem ser&amp;aacute; enviada ao &lt;i&gt;Chatterbox&lt;/i&gt;[id://236794|&amp;#8594;] de forma que pare&amp;ccedil;a vir do usu&amp;aacute;rio ativando o script. Estas coisas s&amp;atilde;o at&amp;eacute; bem inofensivas.&lt;/p&gt;

&lt;p&gt;Outros usos n&amp;atilde;o s&amp;atilde;o t&amp;atilde;o inofensivos. O c&amp;oacute;digo JavaScript pode ter acesso aos cookies do seu browser. &amp;Eacute; mais prov&amp;aacute;vel que estes scripts tenham acesso aos cookies do PerlMonks, inclusive aos que cont&amp;eacute;m seu &lt;i&gt;username&lt;/i&gt; e a forma criptografada de sua senha. Um script poderia pegar esta informa&amp;ccedil;&amp;atilde;o e envi&amp;aacute;-la como uma mensagem privada para o usu&amp;aacute;rio propriet&amp;aacute;rio do &lt;i&gt;home node&lt;/i&gt; que voc&amp;ecirc; est&amp;aacute; olhando. Esta pessoa n&amp;atilde;o seria capaz de fazer &lt;i&gt;login&lt;/i&gt; usando sua conta, pois a senha que ele recebe est&amp;aacute; encriptada. Por outro lado, ele poderia usar o cookie exatamente como est&amp;aacute; para fingir que &amp;eacute; voc&amp;ecirc;.&lt;/p&gt; 

&lt;p&gt;Em sua p&amp;aacute;gina de [User Settings|Configura&amp;ccedil;&amp;otilde;es de Usu&amp;aacute;rio] voc&amp;ecirc; pode marcar a op&amp;ccedil;&amp;atilde;o &quot;Desabilite algum JavaScript nos &lt;i&gt;homenodes&lt;/i&gt;&quot; &amp;#91;&lt;b&gt;N.T.:&lt;/b&gt; a op&amp;ccedil;&amp;atilde;o est&amp;aacute; em ingl&amp;ecirc;s. O original diz '&lt;i&gt;Disable some JavaScript on homenodes&lt;/i&gt;'&amp;#93; mas isso lhe dar&amp;aacute; apenas prote&amp;ccedil;&amp;atilde;o parcial. &lt;i&gt;tags&lt;/i&gt; &lt;code&gt;&lt;script&gt;&lt;/code&gt; ser&amp;atilde;o comentadas, mas outras refer&amp;ecirc;ncias a JavaScript, como atributos de manipula&amp;ccedil;&amp;atilde;o de eventos em outros &lt;i&gt;tags&lt;/i&gt;, n&amp;atilde;o ser&amp;atilde;o afetados.&lt;/p&gt;

&lt;p&gt;Para estar perfeitamente seguro, voc&amp;ecirc; pode abrir as prefer&amp;ecirc;ncias de seu browser e desabilitar o JavaScript. &amp;Eacute; claro, isso vale para todos os websites visitados por voc&amp;ecirc;, o que pode n&amp;atilde;o ser desej&amp;aacute;vel. Alguns sites n&amp;atilde;o funcionam a n&amp;atilde;o ser que o JavaScript seja habilitado.&lt;/p&gt;

&lt;p&gt;Alguns browsers permitem a voc&amp;ecirc; controle mais refinado sobre o qu&amp;ecirc; o c&amp;oacute;digo JavaScript pode fazer. Se seu browser permite isso, desligue as op&amp;ccedil;&amp;otilde;es de acesso a cookies. Voc&amp;ecirc; pode precisar desabilitar outras op&amp;ccedil;&amp;otilde;es como a manipula&amp;ccedil;&amp;atilde;o de janelas.&lt;/p&gt;

&lt;p&gt;Se voc&amp;ecirc; n&amp;atilde;o pode desligar o JavaScript, voc&amp;ecirc; ainda pode conseguir alguma seguran&amp;ccedil;a navegando &lt;i&gt;home nodes&lt;/i&gt; apenas enquanto voc&amp;ecirc; n&amp;atilde;o est&amp;aacute; logado. Desta forma, seu cookie do PerlMonks.org n&amp;atilde;o estar&amp;aacute; presente e o [Anonymous Monk] n&amp;atilde;o pode mandar mensagens no [Chatterbox].&lt;/p&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>275649</node_id>
  <author_user>17342</author_user>
  <title>Os PerlMonks e o JavaScript</title>
  <createtime>2003-07-18 11:47:12</createtime>
  <nodeupdated>2005-08-12 20:02:20</nodeupdated>
</node>
