<node>
  <doctext>&lt;!-- 2003-06-30 dfaure - 0.1 - created placeholder [370749] --&gt;
&lt;!-- 2004-10-24 dfaure - released text --&gt;

&lt;h1&gt;PerlMonks et JavaScript&lt;/h1&gt;

&lt;p align=&quot;right&quot;&gt;&lt;i&gt;Une traduction de/A translation of [id://242931]&lt;/i&gt;&lt;/p&gt;

&lt;p align=&quot;center&quot;&gt;&amp;lt;traduction en cours/translation in progress&amp;gt;&lt;/p&gt;

&lt;p&gt;Il y a des probl&amp;egrave;mes de s&amp;eacute;curit&amp;eacute; inh&amp;eacute;rents &amp;agrave; la navigation avec JavaScript actif. Ce document tente de pr&amp;eacute;ciser o&amp;ugrave; ces dangers r&amp;eacute;sident sur PerlMonks.&lt;/p&gt;

&lt;p&gt;PerlMonks n'utilise pas JavaScript. Toutes les balises g&amp;eacute;n&amp;eacute;r&amp;eacute;es par le moteur du site sont soit de l'HTML, soit du CSS.&lt;/p&gt;

&lt;p&gt;Les utilisateurs cr&amp;eacute;ent le contenu du site. Le code HTML entr&amp;eacute; par les utilisateurs est v&amp;eacute;rifi&amp;eacute; par rapport &amp;agrave; la liste des [id://29281|balises et attributs autoris&amp;eacute;s] pour tenter de filtrer les scripts.&lt;/p&gt;

&lt;p&gt;Malgr&amp;eacute; tout, les utilisateurs peuvent mettre n'importe quoi dans leurs noeuds personnels. Un grand nombre d'utilisateurs ont du JavaScript dans leurs noeuds personnels. Comme n'importe quel &amp;eacute;l&amp;eacute;ment sur la page peut r&amp;eacute;agir &amp;agrave; des ev&amp;eacute;nements 'onClick' ou 'onMouseOver', m&amp;ecirc;me des &amp;eacute;l&amp;eacute;ments apparemment anodins peuvent activer des actions script&amp;eacute;es.&lt;/p&gt;

&lt;p&gt;Quelques utilisateurs utilisent du JavaScript dans leurs noeuds personnels pour avertir les visiteurs du danger de son emploi. Quelques fois, un message sera envoy&amp;eacute; dans la [id://236794|Bo&amp;icirc;te &amp;agrave; discussion]. Ce genre d'utilisation est sans danger r&amp;eacute;el.&lt;/p&gt;

&lt;p&gt;D'autres usages ne sont pas si inoffensifs. Du code JavaScript pourra avoir acc&amp;egrave;s aux cookies de votre navigateur. Le plus probablement, ce code aura acc&amp;egrave;s &amp;agrave; votre cookie PerlMonk qui contient votre identifiant et une forme encrypt&amp;eacute;e de votre mot de passe. Un script pourra prendre ces donn&amp;eacute;es et les envoyer dans un message priv&amp;eacute; &amp;agrave; l'utilisateur dont vous consultez le noeud personnel. L'utilisateur ne pourra pas se connecter sur votre compte puique le mot de passe qu'il aura re&amp;ccedil;u est encrypt&amp;eacute; mais il pourra utiliser le cookie en tel quel et passer pour vous.&lt;/p&gt;

&lt;p&gt;Dans votre page de pr&amp;eacute;f&amp;eacute;rences utilisateurs ([User Settings]), vous pouvez cocher l'option 'D&amp;eacute;sactive le JavaScript dans les noeuds personnels' ('Disable some JavaScript on homenodes'), mais cela ne fournira qu'une protection partielle. Les balises &lt;code&gt;&lt;script&gt;&lt;/code&gt; seront mises en commentaire mais d'autres r&amp;eacute;f&amp;eacute;rences au JavaScript, comme les attributs de gestion des &amp;eacute;venements sur d'autres balises, ne seront pas affect&amp;eacute;es.&lt;/p&gt;

&lt;p&gt;Pout &amp;ecirc;tre parfaitement prot&amp;eacute;g&amp;eacute;, vous pouvez aller sur les pages de configuration de votre navigateur et d&amp;eacute;sactiver JavaScript. Bien sur, cela s'appliquera &amp;agrave; l'ensemble des site que vous visiterez, ce qui n'est pas forc&amp;eacute;ment escompt&amp;eacute;. Beaucoup de sites n&amp;eacute;cessitent que JavaScript soit activ&amp;eacute;.&lt;/p&gt;

&lt;p&gt;Certains navigateurs vous propose un contr&amp;ocirc;le plus fin sur ce que le code JavaScript &amp;agrave; le droit de faire. Si voter navigateur le permet, d&amp;eacute;sactivez les options autorisant l'acc&amp;egrave;s aux cookies. Vous pouvez &amp;eacute;galement d&amp;eacute;sactiver d'autres options comme la manipulation de fen&amp;ecirc;tres.&lt;/p&gt;

&lt;p&gt;Si vous ne pouvez pas d&amp;eacute;sactiver JavaScript, vous pouvez toujours maintenir un certain degr&amp;eacute; de s&amp;eacute;curit&amp;eacute; en consultant les noeuds personnels sans &amp;ecirc;tre connect&amp;eacute;. Votre cookie PerlMonk ne sera pas d&amp;eacute;fini et le Moine Anonyme ([Anonymous Monk]) ne peut pas envoyer de messages de bo&amp;icirc;te &amp;agrave; discussion.&lt;/p&gt;

&lt;hr/&gt;&lt;i&gt;Retour &amp;agrave;/Back to [PerlMonks FAQ]&lt;/i&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>370749</node_id>
  <author_user>17342</author_user>
  <title>PerlMonks et JavaScript</title>
  <createtime>2004-06-30 09:09:35</createtime>
  <nodeupdated>2005-08-12 13:04:43</nodeupdated>
</node>
