<node>
  <doctext>&lt;!-- 2003-05-22 - dfaure - created placeholder [370152] --&gt;
&lt;!-- 2004-06-29 - dfaure - 0.1 - new document --&gt;

&lt;h1&gt;PM est-il l'endroit o&amp;ugrave; avoir la solution &amp;agrave; ses devoirs (&amp;agrave; la maison)?&lt;/h1&gt;

&lt;p align=&quot;right&quot;&gt;&lt;i&gt;Une traduction de/A translation of [id://243874]&lt;/i&gt;&lt;/p&gt;

&lt;p&gt;Beaucoup de questions pos&amp;eacute;es au monast&amp;egrave;re finissent par recevoir une r&amp;eacute;ponse se r&amp;eacute;sumant &amp;agrave; &quot;Faites vous devoirs vous-m&amp;ecirc;me!&quot; Plusieurs personnes peuvent avoir publi&amp;eacute; des probl&amp;egrave;mes similaires dans la m&amp;ecirc;me p&amp;eacute;riode. Ou bien le probl&amp;egrave;me peut &amp;ecirc;tre reformul&amp;eacute; en &quot;J'ai besoin d'un programme pour faire X. Pouvez-vous l'&amp;eacute;crire pour moi? Voici mon adresse email.&quot; Certains ne sont pas aussi &amp;eacute;vidents.&lt;/p&gt;

&lt;p&gt;La plupart des moines n'aiment pas faire vos devoirs &amp;agrave; votre place. Leurs raisons peuvent &amp;ecirc;tre que:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;Ils pensent que vous en apprendrez plus en le faisant par vous-m&amp;ecirc;me.&lt;/li&gt;
&lt;li&gt;Ils se sont sentis insult&amp;eacute;s car vous pensez que votre temps est plus pr&amp;eacute;cieux que le leur.&lt;/li&gt;
&lt;li&gt;Ils pensent que vous faites preuve d'irrespect envers les efforts qu'ils ont consacr&amp;eacute; &amp;agrave; l'apprentissage en leur demandant des r&amp;eacute;ponses toutes faites.&lt;/li&gt;
&lt;li&gt;Ils ne veulent pas &amp;ecirc;tre impliqu&amp;eacute;s dans un comportement d&amp;eacute;shonorant (fond&amp;eacute; ou per&amp;ccedil;u comme tel).&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;D'un autre cot&amp;eacute;, la plupart des moines ne penseront pas &amp;agrave; vous aider dans vos devoirs tant que vous n'aurez pas:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;Indiqu&amp;eacute; qu'il s'agit de devoirs &amp;agrave; r&amp;eacute;soudre&lt;/li&gt;
&lt;li&gt;Publi&amp;eacute; votre tentative de programme de r&amp;eacute;solution&lt;/li&gt;
&lt;li&gt;Pos&amp;eacute; des questions sp&amp;eacute;cifiques aidant &amp;agrave; franchir des obstacles sp&amp;eacute;cifiques.&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;Plut&amp;ocirc;t que de publier une demande d'aide &amp;agrave; faire ses devoirs, essayez de vous d&amp;eacute;brouiller seul avec les moyens suivants:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;Consultez la litt&amp;eacute;rature sur Perl. Les livres d'[http://perl.oreilly.com/|O'Reilly] sont tr&amp;egrave;s r&amp;eacute;put&amp;eacute;s. Beaucoup de livres traitant de Perl sont disponibles chez [http://search.barnesandnoble.com/booksearch/results.asp?WRD=perl|Barnes and
Noble] et d'autres libraires.&lt;/li&gt;
&lt;li&gt;Utilisez [perldoc] pour consulter la documentation Perl sur votre propre syst&amp;egrave;me.&lt;/li&gt;
&lt;li&gt;Utilisez [http://perldoc.perl.org/] pour consulter la documentation Perl en ligne.&lt;/li&gt;
&lt;li&gt;Utilisez [Super Search] pour trouver comment d'auter personnes ont r&amp;eacute;solu des probl&amp;egrave;mes similaires.&lt;/li&gt;
&lt;li&gt;Regardez dans la section '[Tutorials]' (Didacticiels) les articles couvrant votre domaine.&lt;/li&gt;
&lt;/ul&gt;

&lt;hr/&gt;
&lt;i&gt;Retour &amp;agrave;/Back to [PerlMonks FAQ]&lt;/i&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>370152</node_id>
  <author_user>17342</author_user>
  <title>PM est-il l'endroit o&#249; avoir la solution &#224; ses devoirs (&#224; la maison)?</title>
  <createtime>2004-06-28 05:09:15</createtime>
  <nodeupdated>2005-08-12 13:05:51</nodeupdated>
</node>
