<node>
  <doctext>&lt;!-- 2004-06-21 - dfaure - created placeholder [368399] --&gt;
&lt;!-- 2004-06-21 - dfaure - 0.1 - new document --&gt;
&lt;!-- 2004-06-28 - dfaure - 1.0 - corrections applied and changed status to 'Stable' --&gt;

&lt;h1&gt;Quelle confidentialit&amp;eacute; sur PerlMonks ?&lt;/h1&gt;

&lt;p align=&quot;right&quot;&gt;&lt;i&gt;Une traduction de/A translation of [id://174053]&lt;/i&gt;&lt;/p&gt;

&lt;p&gt;Les [gods|dieux] du site ont un acc&amp;egrave;s complet &amp;agrave; la base de donn&amp;eacute;es, au code du site et aux logs du serveur de PerlMonks. Du coup, il n'y a en principe pas grand chose qu'ils ne puissent faire. D'autre groupes d'utilisateurs sp&amp;eacute;ciaux, comme les [editors|&amp;eacute;diteurs] et les [power users|utilisateurs puissants], ont des droits leurs permettant d'affecter les autre utilisateurs, mais dont l'usages est contraint par leur m&amp;eacute;canisme d'application. Les [gods|dieux] n'ont pas de telles contraintes, car ils doivent pouvoir travailler directement avec la base de donn&amp;eacute;es lors le d&amp;eacute;veloppement du site. Il s'agit du mode de fonctionnement normal des sites de forums et des communaut&amp;eacute;s.&lt;/p&gt;

&lt;p&gt;Les [gods|dieux] utilisent des outils web d&amp;eacute;di&amp;eacute;s pour effectuer les t&amp;acirc;ches de maintenance du site, et tr&amp;egrave;s peu d'entre eux pourraient &amp;ecirc;tre utilis&amp;eacute;s dans la surveillance d'utilisateurs. Dans certains cas, des pr&amp;eacute;cautions ont &amp;eacute;t&amp;eacute; prises pour prot&amp;eacute;ger les informations sensibles de l'utilisateur d'une lecture directe. Par exemple, l'outil qui permet &amp;agrave; un [gods|dieu] d'inspecter les variables d'un utilisateur (une circonstance inhabituelle mais non extraordinaire) a &amp;eacute;t&amp;eacute; alt&amp;eacute;r&amp;eacute; pour ne pas  afficher le mot de passe.&lt;/p&gt;

&lt;p&gt;En r&amp;eacute;sum&amp;eacute;, il n'y a de protections particuli&amp;egrave;rement robustes autour de vos informations personnelles ni de vos personnalisations du site. Vous devez le savoir et agir en cons&amp;eacute;quence.&lt;/p&gt;

&lt;p&gt;Ce qui conclut ce que les [gods|dieux] &lt;i&gt;peuvent&lt;/i&gt; faire. Ce qu'ils &lt;i&gt;font&lt;/i&gt; effectivement est un peu diff&amp;eacute;rent.&lt;/p&gt;

&lt;p&gt;L'attention des [gods|dieux] est plut&amp;ocirc;t attir&amp;eacute;e par les automates-de-vote et les comportements abusifs. A la fois les [gods|dieux] et les [power users|utilisateurs puissants] ont la capacit&amp;eacute; de faire taire temporairement les utilisateurs de la [Chatterbox|Bo&amp;icirc;te &amp;agrave; discussion], et le font de temps en temps.&lt;/p&gt;

&lt;p&gt;Un syst&amp;egrave;me raisonnablement extensif a &amp;eacute;t&amp;eacute; mis en place pour permettre aux utilisateurs du site de filtrer les contenus inappropri&amp;eacute;s dans les messages post&amp;eacute;s, et bien que cel&amp;agrave; arrive de temps en temps, il est rarement n&amp;eacute;cessaire que les [gods|dieux] interviennent directement.&lt;/p&gt;

&lt;p&gt;Les [editors|&amp;eacute;diteurs] ont &amp;eacute;galement quelques capacit&amp;eacute;s dans ce domaine. Ils peuvent modifier les messages post&amp;eacute;s. Cel&amp;agrave; arrive r&amp;eacute;guli&amp;egrave;rement -- beaucoup plus souvent d'ailleurs pour corriger des erreurs que du contenu abusif. Les [editors|&amp;eacute;diteurs] peuvent &amp;eacute;galement voter pour &quot;acc&amp;eacute;l&amp;eacute;rer&quot; l'effacement d'un noeud. C'est un usage suppl&amp;eacute;mentaire du processus de prise en compte.&lt;/p&gt;

&lt;p&gt;En termes de surveillance d'utilisateurs, les [gods|dieux] effectuent des analyses statistiques des enregistrements, qui sont r&amp;eacute;put&amp;eacute;es pour traiter les utilisateurs anonymement. Ces outils permettent aux [gods|dieux] d'isoler des utilisateurs ayant un comprtement particuli&amp;egrave;rement inhabituel, sans avoir &amp;agrave; regarder les donn&amp;eacute;es des autres.&lt;/p&gt;

&lt;p&gt;Les [gods|dieux] ont une &amp;eacute;thique qui refl&amp;egrave;te la tradition de volontariat auto-limit&amp;eacute; et de respect d'autrui. Les [gods|dieux] n'ont aucun inter&amp;ecirc;t dans votre fa&amp;ccedil;on de voter. Pour en finir, il s'agit d'une question de confiance. Vous devez utiliser votre propre jugement, et d&amp;eacute;cider vous m&amp;ecirc;me du degr&amp;eacute; d'ouverture d'une telle communaut&amp;eacute;, et si c'est le type d'endroit o&amp;ugrave; vous voulez passer du temps.&lt;/p&gt;

&lt;hr/&gt;&lt;i&gt;Retour &amp;agrave;/Back to [PerlMonks FAQ]&lt;/i&gt;
</doctext>
  <type_nodetype>17338</type_nodetype>
  <node_id>368399</node_id>
  <author_user>17342</author_user>
  <title>Quelle confidentialit&#233; sur PerlMonks ?</title>
  <createtime>2004-06-21 05:52:56</createtime>
  <nodeupdated>2005-08-12 13:11:07</nodeupdated>
</node>
