<node>
  <doctext>&lt;p align=&quot;right&quot;&gt;&lt;small&gt;Tradu&amp;ccedil;&amp;atilde;o do artigo [id://20443].&lt;/small&gt;&lt;/p&gt;
    &lt;p&gt;Algumas vezes, quando Monges buscavam [Seekers of Perl Wisdom|sabedoria], eles eram admoestados por companheiros Monges que desejavam certificar-se de que os [perlman:perlfaq|FAQs] foram lidos, ou pior, diziam a eles &lt;A HREF=&quot;http://www.tuxedo.org/~esr/jargon/html/entry/RTFM.html&quot;&gt;RTFM&lt;/A&gt;. Entretanto, novos monges s&amp;atilde;o muitas vezes intimidados ou confundidos pela informa&amp;ccedil;&amp;atilde;o dispon&amp;iacute;vel e esperam por uma explica&amp;ccedil;&amp;atilde;o mais clara. Al&amp;eacute;m disso, os mais novos dentre os novos muitas vezes n&amp;atilde;o sabem onde encontrar documenta&amp;ccedil;&amp;atilde;o.&lt;/p&gt;
    &lt;p&gt;Eu estou tentando conseguir absolvi&amp;ccedil;&amp;atilde;o dos companheiros Monges para tais pecados venais. Entretanto, existe um pecado quase mortal: falha em reduzir seu problema a um caso de teste m&amp;iacute;nimo.&lt;/p&gt;
    &lt;p&gt;Alguns exemplos s&amp;atilde;o [id://18958|este artigo] de [vnpandey], [id://17376|este artigo] do onipresente [Anonymous Monk], e tamb&amp;eacute;m [id://20297|este node] que n&amp;atilde;o &amp;eacute; nem mesmo Perl, mas sim o resultado de um &lt;code&gt;make install&lt;/code&gt;! Estes artigos cont&amp;eacute;m 250 linhas de c&amp;oacute;digo al&amp;eacute; do que o necess&amp;aacute;rio.&lt;/p&gt;
    &lt;p&gt;Agora confronte aqueles &lt;i&gt;nodes&lt;/i&gt; com este [Difficulty inserting a large object using DBD::Pg|artigo] do [kudra]. [kudra] separou algum tempo para reduzir o c&amp;oacute;digo a um caso de teste m&amp;iacute;nimo de forma que n&amp;oacute;s pud&amp;eacute;ssemos nos focar no problema e n&amp;atilde;o nos distra&amp;iacute;ssemos. Todos os Monges deveriam considerar esta possibilidade. Existem alguns benef&amp;iacute;cios neste comportamento:&lt;/p&gt;
    &lt;ol&gt;
      &lt;li&gt;Voc&amp;ecirc; n&amp;atilde;o [maleteen2000|molesta] os companheiros monges (este link &amp;eacute; uma brincadeira. Eu pessoalmente gosto do garoto).&lt;/li&gt;
      &lt;li&gt;Voc&amp;ecirc; n&amp;atilde;o vai parar na [Worst Nodes|Sala da Vergonha].&lt;/li&gt;
      &lt;li&gt;&amp;Eacute; mais prov&amp;aacute;vel que os Monges lhe ofere&amp;ccedil;am assist&amp;ecirc;ncia.&lt;/li&gt;
      &lt;li&gt;E mais importante: voc&amp;ecirc; pode focalizar no problema.&lt;/li&gt;
    &lt;/ol&gt;

    &lt;p&gt;Este &amp;uacute;ltimo ponto &amp;eacute; cr&amp;iacute;tico. Voc&amp;ecirc; pode at&amp;eacute; mesmo esquecer os outros tr&amp;ecirc;s. Mais de uma vez, tentando isolar um problema, eu tentei reduz&amp;iacute;-lo a um caso de teste m&amp;iacute;nimo. Muitas vezes, removendo a bagun&amp;ccedil;a, o problema acabou fatiado como um bacon. Outras vezes, removendo o c&amp;oacute;digo &quot;irrelevante&quot;, o problema sumiu e eu descobri que o c&amp;oacute;digo irrelevante era o problema.&lt;/p&gt;
    &lt;p&gt;Ent&amp;atilde;o por favor, vamos tentar ter mais considera&amp;ccedil;&amp;atilde;o e reduzir nosso c&amp;oacute;digo tanto quando fact&amp;iacute;vel antes de postar para o Monast&amp;eacute;rio. Voc&amp;ecirc; aprender&amp;aacute; mais sobre seu c&amp;oacute;digo, sobre programa&amp;ccedil;&amp;atilde;o em geral, e ter&amp;aacute; mais chances de ter respostas relevantes para suas quest&amp;otilde;es.&lt;/p&gt;
    &lt;p&gt;Sauda&amp;ccedil;&amp;otilde;es!&lt;br&gt;[Ovid]&lt;/p&gt;
    &lt;p align=&quot;right&quot;&gt;&lt;small&gt;Tradutor: [monsieur_champs|Monsieur Champs].&lt;/small&gt;&lt;/p&gt;</doctext>
  <type_nodetype>956</type_nodetype>
  <node_id>264471</node_id>
  <author_user>260843</author_user>
  <title>Antes que voc&#234; escreva...</title>
  <createtime>2003-06-09 17:39:20</createtime>
  <nodeupdated>2005-08-12 08:30:55</nodeupdated>
</node>
