<node>
  <doctext>&lt;h3&gt;Benvindo ao Mosteiro! Sinta-se em Casa.&lt;/h3&gt;
    &lt;p align=&quot;right&quot;&gt;&lt;small&gt;Tradu&amp;ccedil;&amp;atilde;o do tutorial [id://176063|&quot;Welcome to the Monastery - Make yourself at home&quot;]&lt;/small&gt;&lt;/p&gt;
    &lt;p&gt;Benvindo ao Mosteiro. Estamos contentes por voc&amp;ecirc; vir se juntar a n&amp;oacute;s. O Mosteiro &amp;eacute; vasto, e est&amp;aacute; cheio de salas para estudo, conversas e divertimento. Esperamos que voc&amp;ecirc; fique por algum tempo, &amp;eacute; sempre bom ver convidados tornarem-se habitantes em tempo integral.&lt;readmore&gt;&lt;/p&gt;
    &lt;h3&gt;O Come&amp;ccedil;o&lt;/h3&gt;
    &lt;p&gt;Se voc&amp;ecirc; n&amp;atilde;o conhece o lugar ainda, permita-me mostrar a voc&amp;ecirc; alguma coisa do b&amp;aacute;sico.&lt;/p&gt;
    &lt;p&gt;Antes de mais nada, h&amp;aacute; o [id://131|Monastery Gates], onde voc&amp;ecirc; pode navegar pelos artigos do dia. Para encontrar uma &amp;aacute;rea que lhe interesse, eu sugiro seguir para a sess&amp;atilde;o [Cool Uses for Perl|Usos Interessantes para Perl] para ver algumas aplica&amp;ccedil;&amp;otilde;es diferentes da linguagem, algum [Obfuscated Code|C&amp;oacute;digo Ofuscado] e [Perl Poetry|Poesia] para testar a mente, [Seekers of Perl Wisdom] para colocar uma quest&amp;atilde;o sobre Perl (ou oferecer uma resposta) e [Meditations|Medita&amp;ccedil;&amp;otilde;es] e [Perl Monks Discussion|Discuss&amp;otilde;es dos Monges] para conversar com os outros sobre seus neg&amp;oacute;cios e sua estada no Mosteiro.&lt;/p&gt;
    &lt;p&gt;Cada um destes artigos e cada resposta &amp;agrave; um artigo &amp;eacute; chamado &lt;i&gt;node&lt;/i&gt; (n&amp;oacute;). S&amp;atilde;o destes &lt;i&gt;nodes&lt;/i&gt; que &amp;eacute; feito o Perl Monks. Seu lugar pr&amp;oacute;prio no monast&amp;eacute;rio &amp;eacute; seu &lt;i&gt;home node&lt;/i&gt;. Os &amp;iacute;tens mais &amp;aacute; direita s&amp;atilde;o &lt;i&gt;nodelets&lt;/i&gt;, que prov&amp;ecirc;em mais informa&amp;ccedil;&amp;atilde;o sobre os Perl Monks. O &lt;i&gt;Chatterbox&lt;/i&gt; e &lt;i&gt;Other Users&lt;/i&gt; s&amp;atilde;o para interagir com outros monges no site. Voc&amp;ecirc; pode usar o &lt;i&gt;chatterbox&lt;/i&gt; para perguntar coisas simples ou apenas para passar o tempo com seus companheiros monges.&lt;/p&gt;
    &lt;p&gt;Voc&amp;ecirc; pode ter notado seu nome no topo de cada p&amp;aacute;gina. Clicando n'ele, voc&amp;ecirc; ser&amp;aacute; levado para o seu &lt;i&gt;home node&lt;/i&gt;. Esta &amp;eacute; sua casa longe de casa, onde voc&amp;ecirc; pode postar informa&amp;ccedil;&amp;otilde;es sobre voc&amp;ecirc; ou alterar suas op&amp;ccedil;&amp;otilde;es do Perl Monks. Como uma primeira tarefa, eu sugiro desligar o JavaScript para o &lt;i&gt;home node&lt;/i&gt;. Voc&amp;ecirc; pode fazer isso atrav&amp;eacute;s do link &lt;i&gt;settings&lt;/i&gt; no final da p&amp;aacute;gina do seu &lt;i&gt;home node&lt;/i&gt;.&lt;/p&gt;
    &lt;p&gt;Alguns dos outros Monges deste website t&amp;ecirc;m p&amp;aacute;ginas bem interessantes em seus &lt;i&gt;home nodes&lt;/i&gt;, que est&amp;atilde;o cheias de [turnstep|informa&amp;ccedil;&amp;otilde;es sobre] &lt;i&gt;[turnstep|Perl Monks]&lt;/i&gt;, [jcwren|estat&amp;iacute;sticas], e outras informa&amp;ccedil;&amp;otilde;es que podem interessar a voc&amp;ecirc;. Aqui est&amp;atilde;o alguns dos poucos &lt;i&gt;home nodes&lt;/i&gt; conhecidos pela sua abund&amp;acirc;ncia de informa&amp;ccedil;&amp;otilde;es (em ordem aleat&amp;oacute;ria e nem de longe completo):&lt;/p&gt;
    &lt;ul&gt;
      &lt;li&gt;[turnstep]&lt;/li&gt;
      &lt;li&gt;[crazyinsomniac]&lt;/li&gt;
      &lt;li&gt;[merlyn]&lt;/li&gt;
      &lt;li&gt;[tye]&lt;/li&gt;
      &lt;li&gt;[ybiC]&lt;/li&gt;
      &lt;li&gt;[jcwren]&lt;/li&gt;
      &lt;li&gt;[kudra]&lt;/li&gt;
      &lt;li&gt;[tilly]&lt;/li&gt;
    &lt;/ul&gt;
    &lt;p&gt;Voc&amp;ecirc; pode encontrar o &lt;i&gt;home node&lt;/i&gt; de algu&amp;eacute;m clicando em seu nome do &lt;i&gt;Chatterbox&lt;/i&gt;, ou acima de um n&amp;oacute; de autoria desta pessoa.&lt;/p&gt;
    &lt;h3&gt;Vivendo Aqui&lt;/h3&gt;
    &lt;p&gt;De forma a obter o melhor do Perl Monks, eu sugiro que voc&amp;ecirc; fa&amp;ccedil;a um &lt;i&gt;tour&lt;/i&gt; pelo Monast&amp;eacute;rio. Existem grandes id&amp;eacute;ias fora daqui, mas &amp;eacute; seu trabalho encontr&amp;aacute;-las. A [Super Search|Super Busca] pode ajudar, algumas vezes.&lt;/p&gt;
    &lt;p&gt;Permita que eu lhe indique alguns poucos pontos para voc&amp;ecirc; come&amp;ccedil;ar a se acostumar com o Mosteiro.&lt;/p&gt;
    &lt;ol&gt;
      &lt;li&gt;Se voc&amp;ecirc; tem quest&amp;otilde;es, d&amp;ecirc; uma olhada no [Perl Monks Site FAQ|FAQ do site]. Ou veja o &lt;i&gt;[turnstep|Home Node do Turnstep]&lt;/i&gt;.&lt;/li&gt;
      &lt;li&gt;Use o &lt;i&gt;Chatterbox&lt;/i&gt;.&lt;/li&gt;
      &lt;li&gt;D&amp;ecirc; uma olhada na [id://847|mais antiga piada ainda ativa] do Perl Monks.&lt;/li&gt;
      &lt;li&gt;Leia sobre a [Schwartzian Transform|Transformada Schwartziana].&lt;/li&gt;
      &lt;li&gt;Seja amig&amp;aacute;vel com seus companheiros monges.&lt;/li&gt;
      &lt;li&gt;Veja o que as [Perl Monks Discussion|pessoas est&amp;atilde;o dizendo] sobre o pr&amp;oacute;prio Monast&amp;eacute;rio.&lt;/li&gt;
      &lt;li&gt;Confira o [id://171725|Fama, Fortuna, &quot;ChickStuds&quot; e Pontos de Experi&amp;ecirc;ncia],&lt;/li&gt;
      &lt;li&gt;Leia sobre os [id://3628|mais novos] &lt;i&gt;[id://3628|nodes]&lt;/i&gt; freq&amp;uuml;entemente, e envolva-se na discuss&amp;atilde;o.&lt;/li&gt;
      &lt;li&gt;Se voc&amp;ecirc; tem algum trocado sobrando, despeje-o no [Offering Plate|Prato de Oferendas].&lt;/li&gt;
    &lt;/ol&gt;
    &lt;h3&gt;Obtendo Ajuda&lt;/h3&gt;
    &lt;p&gt;Se voc&amp;ecirc; precisa de alguma ajuda r&amp;aacute;pida com um problema no seu c&amp;oacute;digo fonte, tente pedir no Chatterbox, primeiro. N&amp;atilde;o se esque&amp;ccedil;a dos tags &amp;lt;code&amp;gt; se voc&amp;ecirc; postar algum trecho de c&amp;oacute;digo. Se sua quest&amp;atilde;o for complicada ou precisar de um monte de c&amp;oacute;digo, envie uma pergunta para os [Seekers of Perl Wisdom]. Os monges v&amp;atilde;o responder suas quest&amp;otilde;es da melhor forma poss&amp;iacute;vel.&lt;/p&gt;
    &lt;p&gt;Lembre-se, se voc&amp;eacute; precisar de alguma ajuda, pe&amp;ccedil;a! Sinta-se &amp;agrave; vontade para enviar uma mensagem privada no chatterbox para [newrisedesigns|mim] (ou para o [monsieur_champs|tradutor]) se voc&amp;ecirc; preicsar de alguma ajuda para se acostumar com o Monast&amp;eacute;rio.&lt;/p&gt;
    &lt;p&gt;Aproveite sua estadia no Monast&amp;eacute;rio, e se voc&amp;ecirc; passar pelo [NodeReaper], n&amp;atilde;o deixe de dizer &quot;oi!&quot;.&lt;/p&gt;
      &lt;p align=&quot;right&quot;&gt;&lt;small&gt;Tradutor: [monsieur_champs|Monsieur Champs]&lt;/small&gt;&lt;/p&gt;
</doctext>
  <type_nodetype>956</type_nodetype>
  <node_id>264333</node_id>
  <author_user>260843</author_user>
  <title>Benvindo ao Mosteiro! Sinta-se em Casa (PT_BR)</title>
  <createtime>2003-06-09 10:09:39</createtime>
  <nodeupdated>2005-08-15 12:40:19</nodeupdated>
</node>
