<node>
  <doctext>&lt;p&gt;&lt;small&gt;Translated to spanish from [node://Juerd]'s original [id://252477].&lt;/small&gt;&lt;/p&gt;

&lt;h1&gt;Plain Old Documentation en 5 minutos&lt;/h1&gt;

&lt;h2&gt;La documentaci&#243;n es importante&lt;/h2&gt;

&lt;p&gt;Todos el mundo lo sabe, y sabe por qu&#233;. Me voy a saltar esta secci&#243;n porque cualquier discusi&#243;n detallada de por qu&#233; la documentaci&#243;n es importante romper&#237;a mi promesa de que se puede aprender a documentar en cinco minutos.&lt;/p&gt;

&lt;h2&gt;Documentaci&#243;n en Perl&lt;/h2&gt;

&lt;p&gt;El c&#243;digo fuente en Perl puede contener documentaci&#243;n en formato POD. POD significa &quot;Plain Old Documentation&quot; (documentaci&#243;n simple). Se puede mezclar POD con c&#243;digo, poner todo el POD al principio o ponerlo al final. S&#243;lo depende del gusto de cada uno. T&#250; eliges.&lt;/p&gt;

&lt;h2&gt;Encabezados en POD&lt;/h2&gt;

&lt;p&gt;La estructura l&#243;gica es importante, por tanto se suelen usar encabezados. Hay cuatro niveles, y con esto deber&#237;a llegar. Se usan los comandos &lt;tt&gt;=head1&lt;/tt&gt; .. &lt;tt&gt;=head4&lt;/tt&gt; (oficialmente se les llama &lt;i&gt;comandos de p&#225;rrafo&lt;/i&gt;. Son p&#225;rrafos porque est&#225;n separados del resto del POD mediante l&#237;neas en
blanco).&lt;/p&gt;

&lt;code&gt;=head1 NOMBRE

My::Module - Un m&#243;dulo de ejemplo&lt;/code&gt;

&lt;h2&gt;Secciones habituales&lt;/h2&gt;

&lt;p&gt;Para mantener las cosas claras, se usan las mismas secciones en todas partes. Ya hemos visto la secci&#243;n NOMBRE. S&#237;, es costumbre escribir los p&#225;rrafos head1 en MAY&#218;SCULAS. Si haces m&#243;dulos para CPAN, debes usar este estilo. Si no, o si usas POD para otras cosas que documentaci&#243;n (tambi&#233;n es un formato bueno para escribir art&#237;culos o informes), queda a tu elecci&#243;n.&lt;/p&gt;

&lt;ul&gt;
  &lt;li&gt;&lt;i&gt;NOMBRE&lt;/i&gt; contiene el nombre del m&#243;dulo o script, un gui&#243;n y una descripci&#243;n corta.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;SINOPSIS&lt;/i&gt; significa &quot;ver todo junto&quot; y muestra ejemplos de uso.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;DESCRIPCI&#211;N&lt;/i&gt; contiene una descripci&#243;n larga de lo que hace el m&#243;dulo y lista sus funciones.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;BUGS&lt;/i&gt; o &lt;i&gt;ADVERTENCIAS&lt;/i&gt; habla de los bugs o problemas que el usuario deber&#237;a conocer.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;AGRADECIMIENTOS&lt;/i&gt; es donde el autor agracede a los que arreglan bugs y prueban el programa.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;COPYRIGHT&lt;/i&gt; o &lt;i&gt;LICENCIA&lt;/i&gt; menciona las restricciones de copyright. Sin embargo, no hay que poner toda la GPL :).&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;DISPONIBILIDAD&lt;/i&gt; anuncia d&#243;nde se pueden encontrar versiones m&#225;s recientes.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;AUTOR&lt;/i&gt; explica qui&#233;n ha hecho el programa, si no lo hace ya la secci&#243;n COPYRIGHT.&lt;/li&gt;
  &lt;li&gt;&lt;i&gt;V&#201;ASE TAMBI&#201;N&lt;/i&gt; refiere al lector a un lugar con m&#225;s documentaci&#243;n.&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;Todos estos son para &lt;tt&gt;=head1&lt;/tt&gt;.&lt;/p&gt;

&lt;p&gt;Las funciones, m&#233;todos y todo eso se explican normalmente en una secci&#243;n &lt;tt&gt;=head2&lt;/tt&gt; bajo DESCRIPCI&#211;N.&lt;/p&gt;

&lt;p&gt;Como m&#237;nimo, hay que documentar los argumentos que reciben las funciones y los valores que se devuelven. Si hay condiciones necesarias para algo, se deben mencionar. Si una funci&#243;n devuelve &lt;tt&gt;undef&lt;/tt&gt; cuando hay errores, hay que hac&#233;rselo saber a la gente.&lt;/p&gt;

&lt;p&gt;Est&#225; bien escribir frases cortas. Es mejor evitar las largas.&lt;/p&gt;

&lt;h2&gt;Ejemplos de c&#243;digo&lt;/h2&gt;

&lt;p&gt;Los p&#225;rrafos tabulados se toman como c&#243;digo, con la tabulaci&#243;n intacta. &#161;As&#237; de f&#225;cil!:&lt;/p&gt;

&lt;code&gt;=head1 SINOPSIS

    use My::Module;
    my $object = My::Module-&gt;new(); 
    print $object-&gt;as_string;&lt;/code&gt;

&lt;p&gt;Esto se llama un &lt;i&gt;p&#225;rrafo textual&lt;/i&gt;.&lt;/p&gt;

&lt;h2&gt;Marcado&lt;/h2&gt;

&lt;p&gt;POD soporta un peque&#241;o conjunto de elementos de marcado. Para mantener mi promesa, me voy a limitar a enumerarlos:&lt;/p&gt;

&lt;ul&gt;
  &lt;li&gt;&lt;tt&gt;B&amp;lt;texto en negrita&amp;gt;&lt;/tt&gt;&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;I&amp;lt;texto en cursiva&amp;gt;&lt;/tt&gt;&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;U&amp;lt;texto subrayado&amp;gt;&lt;/tt&gt;&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;C&amp;lt;c&#243;digo&amp;gt;&lt;/tt&gt;&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;B&amp;lt;y se pueden I&amp;lt;anidar&amp;gt;&amp;gt;&lt;/tt&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;Tambi&#233;n hay F, S, X y Z pero apenas se usan y no merece la pena explicarlos en un tutorial peque&#241;o como este.&lt;/p&gt;

&lt;p&gt;Si alguna vez hace falta incluir un car&#225;cter '&amp;gt;' dentro de c&#243;digo, hay dos opciones. Si queremos poner &lt;tt&gt;$foo-&gt;bar&lt;/tt&gt; con fuente de c&#243;digo, podemos hacer esto:&lt;/p&gt;

&lt;ul&gt;
  &lt;li&gt;&lt;tt&gt;C&amp;lt;$foo-E&amp;lt;gt&amp;gt;bar&amp;gt;&lt;/tt&gt;&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;C&amp;lt;&amp;lt; $foo-&amp;gt;bar &amp;gt;&amp;gt;&lt;/tt&gt; (&#161;los espacios son necesarios!)&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;C&amp;lt;&amp;lt;&amp;lt; $foo-&amp;gt;bar &amp;gt;&amp;gt;&amp;gt;&lt;/tt&gt; (&#161;los espacios son necesarios!)&lt;/li&gt;
&lt;/ul&gt;

&lt;h2&gt;Entidades&lt;/h2&gt;

&lt;p&gt;Hemos visto que se puede usar E para entidades. Son como las entidades de HTML; tambi&#233;n tenemos estas:&lt;/p&gt;

&lt;ul&gt;
  &lt;li&gt;&lt;tt&gt;verbar&lt;/tt&gt; para una barra vertical.&lt;/li&gt;
  &lt;li&gt;&lt;tt&gt;sol&lt;/tt&gt; para una barra (solidus).&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;Las entidades num&#233;ricas pueden ir en decimal, octal (con el prefijo '0') y en hexadecimal (con el prefijo '0x').&lt;/p&gt;

&lt;h2&gt;Listas&lt;/h2&gt;

&lt;p&gt;En este caso un ejemplo es mucho m&#225;s claro que una explicaci&#243;n:&lt;/p&gt;

&lt;code&gt;=head2 M&#233;todos

=over 12

=item C&lt;new&gt;

Devuelve un objeto My::Module nuevo.

=item C&lt;as_string&gt;

Devuelve una representaci&#243;n del
objeto en forma de cadena. Sirve
principalmente para depuraci&#243;n.

=back&lt;/code&gt;

&lt;p&gt;Como puede verse, se empieza esta lista con &lt;tt&gt;=over&lt;/tt&gt; y la acabamos con &lt;tt&gt;=back&lt;/tt&gt;. Entre ambos comandos hay &lt;tt&gt;=item&lt;/tt&gt;s. El n&#250;mero despu&#233;s de &lt;tt&gt;=over&lt;/tt&gt; es el nivel de tabulaci&#243;n, usado principalmente por los renderizadores de texto para conseguir un dise&#241;o horizontal. pod2text convierte el ejemplo anterior en:&lt;/p&gt;

&lt;code&gt;  Methods
      &quot;new&quot;       Returns a new
                  My::Module object.

      &quot;as_string&quot; Returns a stringified 
                  representation of the 
                  object. This is mainly
                  for debugging purposes.&lt;/code&gt;

&lt;h2&gt;Otras cositas de POD&lt;/h2&gt;

&lt;p&gt;Se puede usar L para enlazar a secciones del mismo documento o a otros documentos. POD se termina con &lt;tt&gt;=cut&lt;/tt&gt; para volver a Perl. Hay comandos especiales para los distintos formatos de salida. Para leer la documentaci&#243;n completa de POD, teclear:&lt;/p&gt;

&lt;code&gt;perldoc perlpod&lt;/code&gt;

&lt;h2&gt;Un ejemplo completo&lt;/h2&gt;

&lt;code&gt;=head1 NOMBRE

My::Module - Un m&#243;dulo de ejemplo

=head1 SINOPSIS

    use My::Module;
    my $object = My::Module-&gt;new();
    print $object-&gt;as_string;

=head1 DESCRIPCI&#211;N

Este m&#243;dulo no existe en realidad, se
hizo con el &#250;nico objetivo de mostrar
c&#243;mo funciona POD.

=head2 M&#233;todos

=over 12

=item C&lt;new&gt;

Devuelve un objeto My::Module nuevo.

=item C&lt;as_string&gt;

Devuelve una representaci&#243;n del
objeto en forma de cadena. Sirve
principalmente para depuraci&#243;n.

=back

=head1 AUTOR

Juerd - &lt;http://juerd.nl/&gt;

=head1 V&#201;ASE TAMBI&#201;N

L&lt;perlpod&gt;, L&lt;perlpodspec&gt;

=cut&lt;/code&gt;

&lt;h2&gt;Conclusi&#243;n&lt;/h2&gt;

&lt;p&gt;Documentar con POD es f&#225;cil. &#161;A divertirse!&lt;/p&gt;
</doctext>
  <type_nodetype>956</type_nodetype>
  <node_id>558831</node_id>
  <author_user>489671</author_user>
  <title>POD en 5 minutos</title>
  <createtime>2006-07-02 02:21:29</createtime>
  <nodeupdated>2006-07-01 22:21:29</nodeupdated>
</node>
